[
    {
        "index": 0,
        "question": "A fishery wants to transport their catch. They can either use local sled dogs or trucks. Local sled dogs can take 100 fish per trip while trucks can take 300 fish per trip. The cost per trip for sled dogs is $50 while the cost per trip for a truck is $100. The budget is at most $1000 and the number of sled dog trips must be less than the number of truck trips. Formulate an LP to maximize the number of fish that can be transported.",
        "results": {
            "Number of sled dog trips": "0.0",
            "Number of truck trips": "10.0",
            "Maximized number of fish transported": "3000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 1,
        "question": "An office supply company makes two types of printers: color printers and black and white printers. Different sections of the factory with different teams produce each printer. The color printer team can produce at most 20 color printers per day while the black and white printer team can produce at most 30 black and white printers per day. Both teams require use of the same paper tray installing machine and this machine can make at most 35 printers of either type each day. Color printers generate a profit of $200 per printer while black and white printers generate a profit of $70 per printer. How many of each printer should be made to maximize the company's profit?",
        "results": {
            "Number of color printers": "20.0",
            "Number of black and white printers": "15.0",
            "Maximized Profit": "5050.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 2,
        "question": "An accounting firm has senior accountants earning $3000 per week and junior accountants earning $1000 per week. The contracts with companies to provide accounting services require at least 100 accountants, of whom at least 5 must be senior accountants. To make sure there is enough experience on the accounting team, the number of senior accountants should be at least a third of the number to junior accountants. The firm wants to keep the weekly wage bill below $150000. Formulate an LP to minimize the wage bill.",
        "results": {
            "Number of Senior Accountants": "25.0",
            "Number of Junior Accountants": "75.0",
            "Minimized Weekly Wage Bill": "150000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 3,
        "question": "Ben is growing apples and pears on his orchard. He has 50 acres available on which he must grow a minimum of 5 acres of apples and a minimum of 10 acres of pears to meet demands. The profit per apple is $2 and the profit per pear is $4. He prefers to grow more pears than apples but limitations in his workforce allow him to grow at most twice the amount of pears as apples. The acre of apples and pears should be integers. How many of each fruit should Ben grow in order to maximize his profit? What is that profit?",
        "results": {
            "Acres of Apples": "17.0",
            "Acres of Pears": "33.0",
            "Maximized Profit": "166.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 4,
        "question": "A lighting company makes desk-lamps and night-lamps. There is an expected demand of at least 30 desk-lamps and 50 night-lamps each day. However, due to the size of their factory, they can make at most 150 desk-lamps and 180 night-lamps per day. To satisfy a contract, a minimum of 100 lamps must be made each day. If the profit per desk-lamp sold is $5 and the profit per night-lamp sold is $8, how many lamps of each type should be made to maximize profit?",
        "results": {
            "Number of Desk Lamps": "150.0",
            "Number of Night Lamps": "180.0",
            "Maximized Daily Profit": "2190.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 5,
        "question": "Mr. Roberts want to invest in the telecom and healthcare industries. He has $100000 to invest. He has decided that the amount invested in telecom be at least three times as much as the amount invested in healthcare. But the money invested in telecom must be at most $70000. The investment ($) in telecom and healthcare should be integers. If investments in telecom earn 3% and investments in healthcare earn 1%, how much should Mr. Roberts invest in each to maximize profit?",
        "results": {
            "Amount invested in telecom": "70000.0",
            "Amount invested in healthcare": "23333.0",
            "Maximized Profit": "2333.33"
        },
        "type": "linear-notable"
    },
    {
        "index": 6,
        "question": "A farmer has 140 hectares available to grow tomatoes and potatoes. She hopes that the hectares for tomatoes will not be less than those for planting potatoes, but the soil and weather conditions allow her to grow at most twice the amount of tomatoes to that of potatoes. In addition, she must grow at least 20 hectares of tomatoes and at least 30 hectares of potatoes to meet community demands. If the profit per hectare of tomatoes is $350 and the profit per hectare of potatoes is $600, how many hectares of each crop should she plant to maximize profit? What is this profit?",
        "results": {
            "Number of hectares for tomatoes": "70.0",
            "Number of hectares for potatoes": "70.0",
            "Maximized Profit": "66500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 7,
        "question": "A audio company make two types of headphones: wired headphones and wireless headphones. Two different teams make each type of headphones. The wired team can make at most 100 wired headphones per day and the wireless team can make at most 170 wireless headphones per day. Both teams require use of a shared audio testing machine, and this machine can be used to make a maximum of 150 headphones per day. The profit per wired headphone is $50 and the profit per wireless headphone $20. How many of each headphone should be made to maximize profit?",
        "results": {
            "Number of Wired Headphones": "100.0",
            "Number of Wireless Headphones": "50.0",
            "Maximized Profit": "6000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 8,
        "question": "Jacob has $3000 to invest. He has decided to invest in his favorite clothing company and his favorite tech company. He has decided that the money invested in his favorite clothing company must be at least four times as much as the amount invested in his favorite tech company. He has also limited himself to invest at most $500 in his favorite tech company. The investment ($) to the clothing and tech company should be integers. If the money invested in his favorite clothing company earns 7% and the money invested in his favorite tech company earns 10%, how much should he invest in each to maximize his profit?",
        "results": {
            "Amount invested in the clothing company": "2500.0",
            "Amount invested in the tech company": "500.0",
            "Maximized Profit": "225.00000000000003"
        },
        "type": "linear-notable"
    },
    {
        "index": 9,
        "question": "Each month a store owner can spend at most $500 on carrots and cucumbers. A carrot costs the store owner $0.30 and a cucumber costs the store owner $0.50. Each carrot is sold for a profit of $0.75 and each cucumber is sold for a profit of $0.80. The owner estimates that the number of cucumbers sold is at most a third of the number of carrots sold. He also estimates that at least 300 carrots but at most 500 carrots are sold each month. How many of each, carrots and cucumbers, should be sold in order to maximize the profit?",
        "results": {
            "Number of Carrots": "500.0",
            "Number of Cucumbers": "166.0",
            "Maximized Profit": "507.8"
        },
        "type": "linear-notable"
    },
    {
        "index": 10,
        "question": "A farmer wants to manufacture a special plant nutrition using fertilizers A and B. Each kg of fertilizer A contains 13 units of nitrogen, 5 units of phosphoric acid, 6 units of vitamin A and 5 units of vitamin D. Each kg of fertilizer B contains 8 units of nitrogen, 14 units of phosphoric acid, 6 units of vitamin A and 9 units of vitamin D. To be effective, the plant nutrition requires a minimum 220 units of nitrogen, a minimum of 160 units of phosphoric acid, and no more than 350 units of vitamin A. The amount of each fertilizer is an integer in kg. How many kg of each fertilizer should be used to minimize the amount of vitamin D in the nutrition? What is the minimum amount of vitamin D?",
        "results": {
            "Kg of fertilizer A": "13",
            "Kg of fertilizer B": "7",
            "Minimum amount of vitamin D": "128"
        },
        "type": "linear-notable"
    },
    {
        "index": 11,
        "question": "Mrs. Watson wants to invest in the real-estate market and has a total budget of at most $760000. She has two choices which include condos and detached houses. Each dollar invested in condos yields a $0.50 profit and each dollar invested in detached houses yields a $1 profit. A minimum of 20% of all money invested must be in condos, and at least $20000 must be in detached houses. The investment ($) in condos and detached houses should be integers. Formulate an LP that can be used to maximize total profit earned from Mrs. Watson's investment.",
        "results": {
            "Amount invested in condos": "152000.0",
            "Amount invested in detached houses": "608000.0",
            "Maximized Total Profit": "684000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 12,
        "question": "A breakfast joint makes two different sandwiches: a regular and a special. Both need eggs and bacon. Each regular sandwich requires 2 eggs and 3 slices of bacon. Each special sandwich requires 3 eggs and 5 slices of bacon. The joint has a total of 40 eggs and 70 slices of bacon. It makes a profit of $3 per regular sandwich and a profit of $4 per special sandwich. How many of each sandwich should be made to maximize profit?",
        "results": {
            "Number of regular sandwiches": "20.0",
            "Number of special sandwiches": "0.0",
            "Maximized Profit": "60.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 13,
        "question": "A cleaning company located in Edmonton wants to get the best exposure possible for promoting their new dishwashing detergent without exceeding their $450,000 advertising budget. To do so, the company decides to spend their money on two forms of advertising: (1) radio ads and (2) social media ads. Each radio ad costs $5,000; each social media ad costs $9,150. The expected exposure, based on industry ratings, is 60,500 viewers for each radio ad. Additionally, the expected exposure for each social media ad is 50,000 viewers. The company decides that at least 15 but no more than 40 radio ads should be ordered, and that at least 35 social media ads should be contracted. How many ads of each type should be run to obtain maximum exposure while staying within the budget?",
        "results": {
            "Number of Radio Ads": "25.0",
            "Number of Social Media Ads": "35.0",
            "Maximum Exposure": "3262500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 14,
        "question": "There is 1000 mg of gold available that is needed to make long and short cables. Long cables require 10 mg of gold while short cables require 7 mg of gold. Because of their compact size, at least 5 times the number of short cables are needed than the long cables. In addition, there needs to be at least 10 long cables made. If each long cable sold results in a $12 profit and each short cable sold results in a $5 profit, how many of each type of cable should be made to maximize profit?",
        "results": {
            "Number of long cables": "22.0",
            "Number of short cables": "111.0",
            "Maximized Profit": "819.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 15,
        "question": "A store employs senior citizens who earn $500 per week and young adults who earn $750 per week. The store must keep the weekly wage bill below $30000. On any day, the store requires at least 50 workers, of whom at least 10 must be young adults. To ensure the store runs smoothly, the number of young adults should be at least a third the number of senior citizens. Formulate a LP to minimize the wage bill.",
        "results": {
            "Number of senior citizens": "37.0",
            "Number of young adults": "13.0",
            "Minimized Weekly Wage Bill": "28250.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 16,
        "question": "A company is deciding where to promote their product. Some options include z-tube, soorchle engine, and wassa advertisements. The cost for each option and the number of viewers they each attract is given. On z-tube, each ad costs $1000 and attracts 400,000 viewers. On soorchle, each ad costs $200 and attracts 5,000 viewers. On wassa, each ad costs $100 and attracts 3,000 viewers. Soorchle limits the number of advertisements from a single company to fifteen. Moreover, in order to balance the advertising among the three types of media, at most a third of the total number of advertisements should occur on wassa. And at least 5% should occur on z-tube. The weekly advertising budget is $10000. How many advertisements should be run in each of the three types of media to maximize the total audience?",
        "results": {
            "Number of advertisements on Ztube": "10.0",
            "Number of advertisements on Soorchle": "0.0",
            "Number of advertisements on Wassa": "0.0",
            "Maximized Total Audience": "4000000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 17,
        "question": "A chair produced by Elm Furniture yields a profit of $43, while every dresser yields a $52 profit. Each week, 17 gallons of stain and 11 lengths of oak wood are available. Each chair requires 1.4 gallons of stain and 2 lengths of oak wood, while each dresser requires 1.1 gallons of stain and 3 lengths of oak wood. Determine the maximum profit.",
        "results": {
            "Number of Chairs": "4.0",
            "Number of Dressers": "1.0",
            "Maximized Profit": "224.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 18,
        "question": "A farmer wants to mix his animal feeds, Feed A and Feed B, in such a way that the mixture will contain a minimum of 30 units of protein and 50 units of fat. Feed A costs $100 per kilogram and contains 10 units of protein and 8 units of fat. Feed B costs $80 per kilogram and contains 7 units of protein and 15 units of fat. Feeds A and B can only be purchased as integers in kilogram. Determine the minimum cost of the mixture.",
        "results": {
            "Amount of Feed A": "1",
            "Amount of Feed B": "3",
            "Minimum Cost of the Mixture": "340"
        },
        "type": "linear-notable"
    },
    {
        "index": 19,
        "question": "An artisan makes two types of terracotta jars: a thin jar and a stubby jar. Each thin jar requires 50 minutes of shaping time and 90 minutes of baking time. Each stubby jar requires 30 minutes of shaping time and 150 minutes of baking time. Per week, there are 3000 minutes available for shaping and 4000 minutes available for baking. The profit per thin jar is $5 and the profit per stubby jar is $9. How many jars of each type should the artisan make to maximize profit?",
        "results": {
            "Number of Thin Jars": "1.0",
            "Number of Stubby Jars": "26.0",
            "Maximized Weekly Profit": "239.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 20,
        "question": "A grocery store wants to liquidate its stock of 10 apples, 20 bananas, and 80 grapes. Given past experience, the store knows that they can propose a banana-haters package with 6 apples and 30 grapes and that this package will bring a profit of six euros. Similarly, they can prepare a combo package with 5 apples, 6 bananas, and 20 grapes, yielding a profit of seven euros. They know they can sell any quantity of these two packages within the availability of its stock. What quantity of each package, banana-haters packages and combo packages, should the store prepare to maximize net profit?",
        "results": {
            "Number of banana-haters packages": "0.0",
            "Number of combo packages": "2.0",
            "Maximized Net Profit": "14.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 21,
        "question": "A bakery uses a stand-mixer and a slow bake oven to make bread and cookies. Each machine can run for at most 3000 hours per year. To bake a loaf of bread takes 1 hour in the stand mixer and 3 hours in the oven. A batch of cookies requires 0.5 hours in the mixer and 1 hour in the oven. The profit per loaf of bread is $5 and the profit per batch of cookies is $3. How should the bakery operate to maximize total profit?",
        "results": {
            "Number of loaves of bread": "-0.0",
            "Number of batches of cookies": "3000.0",
            "Maximized Total Profit": "9000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 22,
        "question": "A glass factory makes two types of glass panes: a regular glass pane and a tempered glass pane. Both require time on a heating and cooling machine. Both machines are available for a maximum of 300 minutes per day. It takes 3 minutes in the heating machine and 5 minutes in the cooling machine to make one regular glass pane. It takes 5 minutes in the heating machine and 8 minutes in the cooling machine to make one tempered glass pane. The profit per pane of regular glass is $8 and the profit per pane of tempered glass is $10. How many panes of each glass type should the factory make to maximize profit? What is the maximum profit?",
        "results": {
            "Number of regular glass panes": "60.0",
            "Number of tempered glass panes": "0.0",
            "Maximized Profit": "480.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 23,
        "question": "A souvenir shop makes wooden elephants and tigers with plastic ornaments. Each elephant requires 50 grams of wood and 20 grams of plastic. Each tiger requires 40 grams of wood and 30 grams of plastic. In a week, 5000 grams of wood and 4000 grams of plastic are available. The profit per elephant sold is $5 and the profit per tiger sold is $4. How many of each should be made in order to maximize profit?",
        "results": {
            "Number of Elephants": "100.0",
            "Number of Tigers": "0.0",
            "Maximized Weekly Profit": "500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 24,
        "question": "An art store makes large and small art pieces. The store has available 100 units of paint, 50 units of glitter, and 70 units of glue. To make a large art piece requires 4 units of paint, 3 units of glitter, and 5 units of glue. To make a small art piece requires 2 units of paint, 1 unit of glitter, and 2 units of glue. The store must make at least 5 units of each large and small art pieces. If the profit per large art piece is $30 and the profit per small art piece is $15, how many of each should be made to maximize profit?",
        "results": {
            "Number of Large Art Pieces": "5.0",
            "Number of Small Art Pieces": "22.0",
            "Maximized Profit": "480.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 25,
        "question": "My family has decided to invest in real state for the first time. Currently, they have $600,000 to invest, some in apartments and the rest in townhouses. The money invested in apartments must not be greater than $200,000. They have decided that the money invested in apartments must be at least a half as much as that in townhouses. The investment ($) in apartments and townhouses should be integers. If the apartments earn 10%, and the townhouses earn 15%, how much money should they invest in each to maximize profit?",
        "results": {
            "Money invested in apartments": "200000.0",
            "Money invested in townhouses": "400000.0",
            "Maximized Profit": "80000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 26,
        "question": "My grandma is required to take two medicines Z1 and D3 everyday. She needs to take at least 5 grams of Z1 and 10 grams of D3 everyday. These medicines are available in two pills named Zodiac and Sunny. One pill of Zodiac contains 1.3 grams of Z1 while one pill of Sunny contains 1.2 grams of Z1. On the other hand, one pill of Zodiac contains 1.5 grams of D3 and one pill of Sunny contains 5 grams of D3. The cost per pill of Zodiac is $1 and the cost per pill of Sunny is $3. Formulate a LP such that the medicine requirement can be fulfilled at the lowest cost.",
        "results": {
            "Number of Zodiac pills": "7.0",
            "Number of Sunny pills": "0.0",
            "Minimum Total Cost": "7.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 27,
        "question": "A hobbyist makes model trains and planes using wood and paint. A model train requires 3 units of wood and 3 units of paint. A model plane requires 4 units of wood and 2 units of paint. The hobbyist has available 120 units of wood and 90 units of paint. If the profit per model train is $8 and the profit per model plane is $10, how many of each should be made to maximize his profit?",
        "results": {
            "Number of model trains": "20.0",
            "Number of model planes": "15.0",
            "Maximized Profit": "310.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 28,
        "question": "An electronics store wants to optimize how many phones and laptops are enough to keep in inventory. A phone will earn the store $120 in profits, and a laptop will earn $40. A phone requires 1 sq ft of floor space, whereas a laptop requires 4 sq ft. In total, 400 sq ft of floor space is available. The store stocks only phones and laptops. Corporate has required that at least 80% of all appliances in stock be laptops. Finally, a phone costs $400 for the store, and a laptop, $100. The store wants to spend at most $6000. Formulate an LP that can be used to maximize the store's profit.",
        "results": {
            "Number of Phones": "-0.0",
            "Number of Laptops": "60.0",
            "Maximized Profit": "2400.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 29,
        "question": "A candy store mixes regular candy and sour candy to prepare two products, regular mix and sour surprise mix. Each kilogram of the regular mix contains 0.8 kg of regular candy and 0.2 kg of sour candy. The profit per kilogram of the regular mix is $3. Each kilogram of the sour surprise mix contains 0.1 kg of regular candy and 0.9 kg of sour candy. The profit per kilogram of the sour surprise mix is $5. The candy store has 80 kg of regular candy and 60 kg of sour candy available. The production of each candy mix is an integer in kilogram. How many kilograms of each type of candy mix should be created to maximize profits?",
        "results": {
            "Kilograms of Regular Mix": "93",
            "Kilograms of Sour Surprise Mix": "46",
            "Maximized Profit": "509"
        },
        "type": "linear-notable"
    },
    {
        "index": 30,
        "question": "A suspicious factory has 100 sq. feet of space. It makes bootleg phones and laptops. Phones require 2 hours of labor and cost $12 for each sq. foot of space allocated for phone production (cost of electricity and equipment). Laptops require 3 hours of labor and cost $15 for each sq. foot of space allocated for laptop production. Phones produce a net revenue of $50 per sq. foot while laptops produce a net revenue of $70 per sq. foot. The factory wants to spend at most $5000 and 2000 hours of labor. What is the optimal factory layout to maximize revenue?",
        "results": {
            "Square feet for phone production": "0.0",
            "Square feet for laptop production": "100.0",
            "Maximized Revenue": "7000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 31,
        "question": "A electronics store sells premium desktops with more power as well as regular desktops for everyday use. Each premium desktop costs the store $2000 to make and yields a profit of $500. Each regular desktop costs the store $1000 to make and yields a profit of $300. The store sells at most 200 desktops each month and wants to spend at most $300000 on making the desktops. How many of each should be made and sold to maximize profit?",
        "results": {
            "Number of premium desktops": "100.0",
            "Number of regular desktops": "100.0",
            "Maximized Profit": "80000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 32,
        "question": "A car manufacturer makes two versions of the same car, a regular model and a premium model. They make x1 regular models per day and x2 premium models per day. The profit per regular model is $5000 and the profit per premium model is $8500 (x1 and x2 are unknown values both greater than or equal to 0). The daily demand for these cars is limited to and most 8 regular models and 6 premium models. In addition, the manufacturer can make a maximum of 12 cars of either type per day. How many cars of each model should the manufacturer make in order to maximize profit?",
        "results": {
            "Number of regular models": "6.0",
            "Number of premium models": "6.0",
            "Maximized Profit": "81000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 33,
        "question": "You are designing an office space with two types of desks: long desks and short desks. You can spend at most $2000. Long desks cost $300, take up 10 square feet of space, and seat 6 employees. Short desks cost $100, take up 4 square feet of space, and seat 2 employees. The office can have at most 200 square feet of desks. How many of each desk should you buy in order to maximize the seating availability?",
        "results": {
            "Number of Long Desks": "-0.0",
            "Number of Short Desks": "20.0",
            "Maximized Seating Availability": "40.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 34,
        "question": "Ayse produces a plant growth compound by mixing two types of fertilizer: C and Y. This growth compound must contain at least 5 units of nitrous oxide and 8 units of vitamin mix. Fertilizer C and Y cost $2 and $3 per kg respectively. Fertilizer C contains 1.5 units of nitrous oxide per kg and 3 units of vitamin mix per kg. Fertilizer Y contains 5 units of nitrous oxide per kg and 1 unit of vitamin mix per kg. Fertilizer C and Y can only be purchased in integers in kg. Determine the minimum cost of Ayse's compound.",
        "results": {
            "Amount of fertilizer C": "4",
            "Amount of fertilizer Y": "0",
            "Minimum Cost of Ayse's Compound": "8"
        },
        "type": "linear-notable"
    },
    {
        "index": 35,
        "question": "Sleep inducing medicine and anti-inflammatory medicine is found in two pills, pill A and pill B. One pill A contains 3 units of sleep inducing medicine and 5 units of anti-inflammatory medicine. One pill B contains 6 units of sleep-inducing medicine and 1 unit of anti-inflammatory medicine. The cost per pill for pill A is $4 and the cost per pill for pill B is $5. A patient must consume these two pills to get at least 40 units of sleep-inducing medicine and 50 units of anti-inflammatory medicine. Formulate a LP to minimize the cost for the patient.",
        "results": {
            "Number of Pill A": "10.0",
            "Number of Pill B": "2.0",
            "Minimized Cost": "50.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 36,
        "question": "A car manufacturer makes two types of car oils: Oil Max and Oil Max Pro. A container of Oil Max contains 46 grams of substance A, 43 grams of substance B and 56 grams of substance C. A container of Oil Max Pro contains 13 grams of substance A, 4 grams of substance B and 45 grams of substance C. The car manufacturer has 1345 grams of substance A, 346 grams of substance B, 1643 grams of substance C. In addition, the profit per container of Oil Max is $10 and the profit per container of Oil Max Pro is $15. How many containers of each of oil should the car manufacturer make to maximize profit?",
        "results": {
            "Number of Oil Max containers": "-0.0",
            "Number of Oil Max Pro containers": "36.0",
            "Maximized Profit": "540.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 37,
        "question": "A food truck owner can spend at most $20000 on mangos and guavas. A mango costs the food truck owner $5 and a guava costs him $3. Spices are added and each mango is sold for a profit of $3 while each guava is sold for a profit of $4. The owner estimates that at least 100 mangos but at the most 150 are sold each month. He also estimates that the number of guavas sold is at most a third of the mangos sold. How many mangos and guavas should be sold in order to maximize the profit?",
        "results": {
            "Number of Mangos": "150.0",
            "Number of Guavas": "50.0",
            "Maximized Profit": "650.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 38,
        "question": "A nutritionist is making a special vitamin mix using two drinks: A and B. The vitamin mix must contain at least 150 units of Vitamin A, at least 300 units of vitamin D, and at most 500 units of vitamin E. A cup of drink A contains 8 units of Vitamin A, 6 units of Vitamin D, 10 units of Vitamin E, and 4 units of Vitamin K. A cup of drink B contains 15 units of Vitamin A, 2 units of Vitamin D, 20 units of Vitamin E, and 12 units of Vitamin K. How many cups of each drink should be used to make the vitamin mix in order to minimize the amount of Vitamin K?",
        "results": {
            "Number of cups of drink A": "50.0",
            "Number of cups of drink B": "0.0",
            "Minimized amount of Vitamin K": "200.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 39,
        "question": "An ice cream store makes chocolate and vanilla ice cream by the gallon. In a week, they must make at least 5 gallons of each type but at most 10 gallons of chocolate ice cream and at most 8 gallons of vanilla ice cream. It takes 1 hour to produce a gallon of chocolate ice cream and 2 hours to produce a gallon of vanilla ice cream. In a week, 30 hours are available to make ice cream. In addition at least 6 workers are needed with 1 working on the chocolate ice cream and 2 on the vanilla ice cream at any time. If the profit per gallon of chocolate ice cream is $200 and the profit per gallon of vanilla ice cream is $300, how many gallons of each should be made to maximize profit?",
        "results": {
            "Gallons of chocolate ice cream": "10.0",
            "Gallons of vanilla ice cream": "8.0",
            "Maximized Profit": "4400.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 40,
        "question": "Mark has 50 acres of land available to grow potatoes and cucumbers that he sells at a farmers' market. He must grow at least 12 acres of potatoes and 15 acres of cucumbers to meet his contract. Mark prefers to grow more cucumbers than potatoes, but he only has enough resources to grow at most twice the amount of cucumbers as potatoes. The acre of each crop should be a integer. If the profit per acre of potatoes is $500 and the profit per acre of cucumbers is $650, how many acres of each should he grow to maximize his profit? What is that profit?",
        "results": {
            "Number of acres for potatoes": "17",
            "Number of acres for cucumbers": "33",
            "Maximized Profit": "29950.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 41,
        "question": "A flooring company produces engineered hardwood and vinyl planks. Their sales forecasts show an expected demand of at least 20,000 square foot of hardwood and 10,000 square feet of vinyl planks each week. To satisfy a shipping contract, a total of at least 60,000 square feet of flooring much be shipped each week. Due to a labor shortage issue, no more than 50,000 square feet of hardwood and 30,000  square feet of vinyl  can be produced weekly. If a square foot of hardwood flooring yields a profit of $2.5 and a square foot of vinyl planks produces a $3 profit, how many of each type of flooring should be made weekly to maximize the company's profit?",
        "results": {
            "Square feet of Hardwood": "50000.0",
            "Square feet of Vinyl": "30000.0",
            "Maximized Weekly Profit": "215000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 42,
        "question": "A berry farmer has two farms, an old and new farm, where he grows raspberries, blueberries, and strawberries. He has a contract to provide a local store with 10 kg of raspberries, 9 kg of blueberries, and 15 kg of strawberries. At his old farm, it cost $300 to operate per day and he can harvest and deliver 2 kg of raspberries, 2 kg of blueberries, and 4 kg of strawberries in a day. At his new farm, it costs $200 to operate per day and he can harvest and deliver 4 kg of raspberries, 1 kg of blueberries, and 2 kg of strawberries in a day. Formulate a LP to meet his contract while minimizing his cost.",
        "results": {
            "Days to operate old farm": "4.0",
            "Days to operate new farm": "1.0",
            "Minimized Cost": "1400.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 43,
        "question": "Jordan is a chef. He wants to design a diet consisting of Kebabs and Rice.  Assume that each serving of Rice costs $3 and contains 300 calories and 4.5 grams of protein. Assume that each serving of Kebab costs $2 and contains 200 calories and 4 grams of protein. He's interested in spending as little money as possible but he wants to ensure that his meals have at least 2200 calories and at least 30 grams of protein per day. Formulate a linear programming problem that will help minimize the cost of the diet.",
        "results": {
            "Number of servings of Kebab": "11.0",
            "Number of servings of Rice": "0.0",
            "Minimum Cost of the Diet": "22.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 44,
        "question": "A company sells custom scooters and bikes for customers. The profit per scooter is $200 and the profit per bike is $300. Each product requires time with the design team and engineering team. Each scooter needs 2 hours with the design team and 3 hours with the engineering team. Each bike needs 4 hours with the design team and 5 hours with the engineering team. Per month, there are 5000 hours available on the design team and 6000 hours available on the engineering team. How many of each should the company make per month to maximize profit?",
        "results": {
            "Number of Scooters": "2000.0",
            "Number of Bikes": "0.0",
            "Maximized Monthly Profit": "400000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 45,
        "question": "John has a 300 acre berry farm on which to plant blueberries and raspberries. John has $10000 to spend on watering and 575 days worth of labor available. For each acre of blueberries, 6 days worth of labor and $22 in watering costs is required. For each acre of raspberries, 3 days worth of labor and $25 in watering costs is required. The profit per acre of blueberries is $56 and the profit per acre of raspberries is $75. The acre of blueberries and raspberries should be integers. Formulate an LP problem in order to maximize profit.",
        "results": {
            "Number of acres for Blueberries": "-0.0",
            "Number of acres for Raspberries": "191",
            "Maximized Profit": "14325.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 46,
        "question": "A man  only eats vegetable and fruits. A serving of vegetables contains 2 units of vitamins and 3 units of minerals. A serving of fruit contains 4 units of vitamins and 1 unit of minerals. He wants to eat at least 20 units of vitamins and 30 units of minerals. If vegetables cost $3 per serving and fruits cost $5 per serving, how many servings of each should he eat to minimize his cost?",
        "results": {
            "Number of servings of vegetables": "10.0",
            "Number of servings of fruits": "0.0",
            "Minimum Cost": "30.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 47,
        "question": "A bakery bakes bagels and croissants. A batch of bagels can be made using 2 hours of oven time and 0.25 hours of pastry chef time. A batch of croissants is more complicated, so while they take 1 hour of oven time, they take 2 hours of pastry chef time. In a day, the bakery has at most 70 hours available for the oven and 32 pastry chef hours available. Using all the available capacity, what is the maximum profit the bakery can generate assuming the profit per batch is $20 and $40 respectively for a batch of bagels and a batch of croissants.",
        "results": {
            "Number of batches of Bagels": "29.0",
            "Number of batches of Croissants": "12.0",
            "Maximized Profit": "1060.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 48,
        "question": "A teddy bear company produces three different colored bears: black, white, and brown. These bears are made in two different factories. Running factory 1 for 1 hour costs $300 and produces 5 black teddy bears, 6 white teddy bears, and 3 brown ones. Running factory 2 for 1 hour costs $600 and produces 10 black teddy bears and 10 white teddy bears. (but no brown ones). To meet children's demand, at least 20 black teddy bears, 5 white teddy bears, and 15 brown teddy bears must be made daily. Given this information, develop a linear programming problem assuming the teddy bear company wants to minimize the cost of production.",
        "results": {
            "Hours factory 1 runs": "5.0",
            "Hours factory 2 runs": "0.0",
            "Minimized Cost of Production": "1500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 49,
        "question": "A farmer has 500 acres of land to grow turnips and pumpkins. Turnips require 50 minutes of watering and $80 worth of pesticide per acre. Pumpkins require 90 minutes of watering and $50 worth of pesticide per acre. The farmer has 40000 minutes available for watering and $34000 available to spend on pesticide. If the revenue per acre of turnips is $300 and the revenue per acre of pumpkins is $450, how many acres of each should he grow to maximize his revenue.",
        "results": {
            "Number of acres for turnips": "124.99999999999997",
            "Number of acres for pumpkins": "375.0",
            "Maximized Revenue": "206250.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 50,
        "question": "A school employs staff and substitute teachers. Per shift, staff teachers work 6 hours and get paid $300. Per shift, substitute teachers work 3 hours and get paid $100. For the summer term, the school requires 1000 hours of teaching availability. If the school has a budget of $40000, how many of each teacher should be hired to minimize the total number of teachers?",
        "results": {
            "Number of staff teachers": "66.0",
            "Number of substitute teachers": "202.0",
            "Minimum Total Number of Teachers": "268.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 51,
        "question": "A gem factory has two drills, a high intensity one and a low intensity one. Each day, the high intensity drill can process 50 gems and requires 50 units of water to dissipate heat. Each day, the low intensity drill can process 30 gems and requires 20 units of water to dissipate heat. Each day the factory must process 800 gems and they have available 700 units of water. Since the high intensity drill produces a lot of noise pollution, at most 40% of the drills can be high intensity ones. Further, at least 10 should be low intensity drills. How many of each drill should be used to minimize the total number of drills needed?",
        "results": {
            "Number of High Intensity Drills": "8.0",
            "Number of Low Intensity Drills": "14.0",
            "Total Number of Drills Needed": "22.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 52,
        "question": "A sandwich company can open two types of stores, a dine-in place and a food-truck. A dine-in place can make 100 sandwiches per day and requires 8 employees to operate. A food-truck can make 50 sandwiches per day and requires 3 employees to operate. The company must make at least 500 sandwiches per day but they only have available 35 employees. How many of each type of store should the company open to minimize the total number of stores?",
        "results": {
            "Number of Dine-In Places": "2.0",
            "Number of Food-Trucks": "6.0",
            "Minimum Total Number of Stores": "8.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 53,
        "question": "There are two processes, process A and process B, to plate a coin with gold. Process A requires 3 units of gold, 2 wires, and can plate 5 coins. Process B requires 5 units of gold, 3 wires, and can plate 7 coins. There are 500 units of gold and 300 wires available. How many processes of each type should be run to maximize the total number of coins that can be plated?",
        "results": {
            "Number of Process A": "150.0",
            "Number of Process B": "0.0",
            "Maximized Total Number of Coins": "750.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 54,
        "question": "A woodshop can purchase two types of saws, a miter saw and a circular saw. A miter saw can cut 50 planks of wood and produces 60 units of sawdust per day. A circular saw can cut 70 planks of wood and produces 100 units of sawdust per day. The woodshop must cut at least 1500 planks of wood per day. However, to avoid too much pollution in the woodshop they can produce at most 2000 units of sawdust per day. How many of each type of saw should be purchased to minimize the total number of saws needed?",
        "results": {
            "Number of Miter Saws": "15.0",
            "Number of Circular Saws": "11.0",
            "Minimum Total Number of Saws Needed": "26.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 55,
        "question": "A farmer has 200 acres of land on which he must process hay using either a windrower or hay harvester. For each acre of land, the windrower can process 10 kg of hay while the hay harvester can process 8 kg of hay. Per acre, the windrower produces 5 kg of methane gas and requires 2 kg of fuel. On the other hand, the hay harvester produces 3 kg of methane gas per acre and requires 1 kg of fuel. There are 300 kg of fuel available and the farmer can produce at most 800 kg of methane gas. For how many acres should each machine be used to maximize the amount of hay processed?",
        "results": {
            "Acres for Windrower": "100.0",
            "Acres for Harvester": "100.0",
            "Maximized amount of hay processed": "1800.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 56,
        "question": "A new fast food place makes wraps and platters. Each wrap requires 5 units of meat and 3 units of rice. Each platter requires 7 units of meant and 5 units of rice. While each wrap takes 10 minutes to make, each platter takes 8 minutes to make. The fast food place must use at least 3000 units of meat and 2500 units of rice. Since wraps are easier to eat on the go, at least 3 times as many wraps need to be made as platter. How many of each should the fast food place make to minimize the total production time?",
        "results": {
            "Number of wraps": "537.0",
            "Number of platters": "178.0",
            "Minimized Total Production Time": "6794.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 57,
        "question": "An amusement park is installing ticket machines, both cash-based and card-only machines. A cash-based machine can process 20 people per hour while a card-only machine can process 30 people per hour. The cash-based machine needs 4 rolls of paper per hour while the card-only machine requires 5 rolls of paper per hour. The amusement park needs to be able to process at least 500 people per hour but can use at most 90 rolls of paper per hour. Since most people prefer to pay by cash, the number of card-only machines must not exceed the number of cash-based machines. How many of each machine should be bought to minimize the total number of machines in the park?",
        "results": {
            "Number of cash-based machines": "10.0",
            "Number of card-only machines": "10.0",
            "Minimum total number of machines": "20.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 58,
        "question": "A honey farmer sells his honey in glass and plastic jars. A glass jar can hold 250 ml of honey while a plastic jar can hold 300 ml of honey. Since glass jars are more expensive, at least twice as many plastic jars must be filled as glass jars. However, at least 20 glass jars should be filled. If the farmer has 20000 ml of honey, how many jars of each should be filled to maximize the total number of bottles filled?",
        "results": {
            "Number of glass jars": "20.0",
            "Number of plastic jars": "50.0",
            "Maximized Total Number of Jars": "70.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 59,
        "question": "A bubble tea shop sells mango and lychee bubble tea. Each mango bubble tea requires 4 units of mango juice and 8 units of tea. Each lychee bubble tea requires 6 units of lychee juice and 6 units of tea. The shop has available 2000 units of mango juice and 3000 units of lychee juice. At least 40% of the bubble teas made must be lychee flavored. However, mango bubble tea sells better and thus the number of mango bubble teas made must be large than the number of lychee bubble teas made. They sell at least 100 cups a day. How many of each bubble tea flavor should be made to minimize the total amount of tea needed?",
        "results": {
            "Number of Mango bubble teas": "51.0",
            "Number of Lychee bubble teas": "49.0",
            "Minimum Total Amount of Tea Needed": "702.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 60,
        "question": "A city employs seasonal and permanent snow removers. A seasonal snow remover works 6 hours per shift and gets paid $120. A permanent snow remover works 10 hours per shift and gets paid $250. Currently the city needs 300 hours of snow remover labor after a heavy snowfall. If the city has a budget of $6500, how many of each type of worker should be hired to minimize the total number of snow removers?",
        "results": {
            "Number of Seasonal Snow Removers": "35.0",
            "Number of Permanent Snow Removers": "9.0",
            "Total Number of Snow Removers": "44.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 61,
        "question": "A high rise building is buying two types of furnaces, a new model and an old model. A new model furnace can heat 10 apartments and consumes 200 kWh per day. An old model can heat 15 apartments and consumes 250 kWh per day. Since the old model is harder to find, at most 35% of the furnaces can be the old model and at least 5 new model furnaces should be used. If the high rise needs to heat at least 200 apartments and has 35000 kWh of electricity available, how many of each furnace should be purchase to minimize the total number of furnaces?",
        "results": {
            "Number of New Model Furnaces": "12.0",
            "Number of Old Model Furnaces": "6.0",
            "Minimized Total Number of Furnaces": "18.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 62,
        "question": "A cell phone company is building rural and urban factories. A rural factory can make 100 phones per day and requires 8 managers. An urban factory can make 200 phones per day and requires 20 managers. The company has available 260 managers and must make at least 3000 phones per day. How many of each factory type should be built to minimize the total number of factories?",
        "results": {
            "Number of Rural Factories": "20.0",
            "Number of Urban Factories": "5.0",
            "Minimized Total Number of Factories": "25.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 63,
        "question": "An ice cream store can buy two machines, a counter-top sized one and a fridge sized one, to make ice cream. The counter-top sized one can produce 80 cones worth of ice cream every day while the fridge sizes one can produce 150 cones worth of ice cream every day. The counter-top sized machine outputs 50 units of heat while the fridge sized one outputs 70 units of heat. The ice cream store can output at most 500 units of heat per day and must produce at least 1000 cones worth of ice cream. How many of each machine should they buy to minimize the total number of machines needed?",
        "results": {
            "Number of counter-top sized machines": "-0.0",
            "Number of fridge sized machines": "7.0",
            "Minimum total number of machines needed": "7.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 64,
        "question": "There are two specialized containers, a small and large one, that are used to make a pharmaceutical paste. The small container requires 10 units of water and 15 units of the powdered pill to make 20 units of the paste. The large container requires 20 units of water and 20 units of the powdered pill to make 30 units of the paste. The pharmacy has available 500 units of water and 700 units of the powdered pill. How many of each container should be used to maximize the amount of paste that can be made?",
        "results": {
            "Number of small containers used": "40.0",
            "Number of large containers used": "5.0",
            "Maximized amount of paste that can be made": "950.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 65,
        "question": "An oil and gas company operates on 300 acres of land where they use oil wells of small and large size. Per acre of land, a small oil well can produce 2 barrels of oil. Per acre of land, a large oil well can produce 5 barrels of oil. However, a small oil well produces 10 units of pollution and requires 5 drill bits per acre and a large oil well produces 20 units of pollution and requires 10 drill bits per acre. The company has available 2500 drill bits and due to strict environmental laws can produce at most 4500 units of pollution. For how many acres should each oil well be used to maximize the total production of oil?",
        "results": {
            "Acres for small oil wells": "0.0",
            "Acres for large oil wells": "225.0",
            "Maximized Total Production of Oil": "1125.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 66,
        "question": "A bakery makes almond and pistachio croissants. An almond croissant requires 5 units of butter and 8 units of flour. A pistachio croissant requires 3 units of butter and 6 units of flour. The bakery has available 600 units of butter and 800 units of flour. Since the almond croissant is more popular, at least 3 times as many almond croissants should be made as pistachio croissants. If making an almond croissant takes 12 minutes and making a pistachio croissant takes 10 minutes, how many of each should be made to minimize the total production time?",
        "results": {
            "Number of almond croissants": "0.0",
            "Number of pistachio croissants": "-0.0",
            "Minimized Total Production Time": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 67,
        "question": "A burger chain is buying both gas and electric grills to make burger patties. A gas grill can cook 20 patties per minute while an electric grill can cook 30 patties per minute. The gas grill requires 20 units of cooking oil per minute while the electric grill requires 25 units of cooking oil per minute. Since the gas grill patties taste better, the number of electric grills must be no more than the number of gas grills. Further, the burger chain wants to be able to make at least 150 patties per minute and use at most 140 units of cooking oil per minute. How many of each grill should be bought to minimize the total number of grills in the store?",
        "results": {
            "Number of Gas Grills": "3.0",
            "Number of Electric Grills": "3.0",
            "Minimum Total Number of Grills": "6.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 68,
        "question": "A cough syrup company sells cough syrup in kids and adult size bottles. A kids size bottle can hold 100 ml of cough syrup while an adult size bottle can hold 300 ml of cough syrup. Since there is no difference in concentration of medical ingredients between the two bottles, at least 3 times as many adult size bottle must be made as kids size bottles. However, at least 50 kids size bottles must be made. If the company has 250000 ml of cough syrup available, how many bottles of each should be made to maximize the total number of bottles?",
        "results": {
            "Number of Kids size bottles": "250.0",
            "Number of Adult size bottles": "750.0",
            "Maximized Total Number of Bottles": "1000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 69,
        "question": "A bakery makes fiber supplemented brownies and lemon squares. Each brownie requires 5 units of chocolate mix and 4 units of fiber. Each lemon square requires 7 units of lemon mix and 6 units of fiber. Lemon squares sell much faster and thus the number of lemon squares made must be larger than the number of brownies made. However, to please all customers, at least 40% of the items made must be brownies. If the bakery has 2500 units of chocolate mix and 3300 units of lemon mix, how many of each should be made to minimize the total amount of fiber needed?",
        "results": {
            "Number of Brownies": "0.0",
            "Number of Lemon Squares": "0.0",
            "Minimum Total Amount of Fiber Needed": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 70,
        "question": "A clinic employs nurses and pharmacists to deliver shots to patients. A nurse works 5 hours per shift while a pharmacist works 7 hours per shift. Nurses are paid $250 per shift while pharmacists are paid $300 per shift. Currently, the clinic needs 200 hours of healthcare labor to meet needs. If the firm has a budget of $9000, how many of each healthcare worker should be scheduled to minimize the total number of workers?",
        "results": {
            "Number of Nurses": "0.0",
            "Number of Pharmacists": "29.0",
            "Minimum Total Number of Workers": "29.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 71,
        "question": "A laundromat can buy two types of washing machines, a top-loading model and a front-loading model. The top-loading model can wash 50 items per day while the front-loading model can wash 75 items per day. The top-loading model consumes 85 kWh per day while the front-loading model consumes 100 kWh per day. The laundromat must be able to wash at least 5000 items per day and has available 7000 kWh per day. Since the top-loading machine are harder to use, at most 40% of the machines can be top-loading. Further, at least 10 machines should be front-loading. How many of each machine should the laundromat buy to minimize the total number of washing machines?",
        "results": {
            "Number of top-loading machines": "0.0",
            "Number of front-loading machines": "67.0",
            "Total number of washing machines": "67.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 72,
        "question": "A bank can build small and large branches to serve their customers. A small branch can serve 50 customers per day and requires 10 bank tellers. A large branch can serve 100 customers per day and requires 15 bank tellers. The bank has available 200 bank tellers and needs to be able to serve at least 1200 customers per day. How many of each branch size should they build to minimize the total number of branches needed?",
        "results": {
            "Number of small branches": "0.0",
            "Number of large branches": "12.0",
            "Minimum total number of branches needed": "12.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 73,
        "question": "A shipping company can purchase regular and hybrid vans to make deliveries. A regular van can deliver 500 packages per day and produces 200 units of pollutants. A hybrid van can deliver 300 packages per day and produces 100 units of pollutants. Due to a new environmental law, they can produce at most 7000 units of pollutants per day. However, the company needs to be able to deliver at least 20000 packages per day. How many of each type of van should they buy to minimize the total number of vans needed?",
        "results": {
            "Number of regular vans": "10.0",
            "Number of hybrid vans": "50.0",
            "Minimum total number of vans needed": "60.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 74,
        "question": "In order to make carbon dioxide, wood is burned using two processes, with a catalyst and without a catalyst. The process with a catalyst requires 10 units of wood and 20 units of oxygen to make 15 units of carbon dioxide. The process without a catalyst requires 15 units of wood and 12 units of oxygen to make 18 units of carbon dioxide. There are 300 units of wood and 300 units of oxygen available. How many of each process should be used to maximize the amount of carbon dioxide produced?",
        "results": {
            "Number of processes with a catalyst used": "3.0",
            "Number of processes without a catalyst used": "18.0",
            "Maximized amount of carbon dioxide produced": "369.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 75,
        "question": "A tea estate has available 500 acres of land and they need to pick the tea leaves either using a traditional machine or modern machine. For each acre of land, the traditional machine can pick 30 kg of tea leaves, creates 10 kg of waste, and requires 20 liters of fuel. For each acre of land, the modern machine can pick 40 kg of tea leaves, creates 15 kg of waste, and requires 15 liters of fuel. The estate has available 9000 liters of fuel can handle at most 6000 kg of waste. For how many acres should each machine be used to maximize the amount of tea leaves that can be picked?",
        "results": {
            "Acres for traditional machine": "299.99999999999994",
            "Acres for modern machine": "200.00000000000006",
            "Maximized amount of tea leaves picked": "17000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 76,
        "question": "A grilled cheese shop sells a light and heavy grilled cheese sandwich. A light grilled cheese sandwich requires 2 slices of bread and 3 slices of cheese. A heavy grilled cheese sandwich requires 3 slices of bread and 5 slices of cheese. Since most people who come to the store love grilled cheese, the store must make at least 3 times as many heavy grilled cheese sandwiches as light grilled cheese sandwiches. The store has available 300 slices of bread and 500 slices of cheese. If a light grilled cheese sandwich takes 10 minutes to make and a heavy grilled cheese sandwich takes 15 minutes to make, how many of each should they make to minimize the total production time?",
        "results": {
            "Number of light grilled cheese sandwiches": "-0.0",
            "Number of heavy grilled cheese sandwiches": "0.0",
            "Minimized Total Production Time": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 77,
        "question": "A post office is buying stamping machines and they can buy a dual or single model stamping machine. A dual model stamping machine can stamp 50 letters per minute while a single model stamping machine can stamp 30 letters per minute. The dual model stamping machine requires 20 units of glue per minute while the single model stamping machine requires 15 units of glue per minute. Since the single model stamping machine is quieter, the number of single model stamping machines must be more than the number of dual model stamping machines. Further, the post office wants to make sure they can stamp at least 300 letters per minute and use at most 135 units of glue per minute. How many of each stamping machine should they purchase to minimize the total number of stamping machines?",
        "results": {
            "Number of Dual Model Stamping Machines": "3.0",
            "Number of Single Model Stamping Machines": "5.0",
            "Minimized Total Number of Stamping Machines": "8.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 78,
        "question": "A banana company sells their bananas in small and large crates. A small crate can hold 20 bananas while a large crate can hole 50 bananas. Since large crates are more manageable, the number of large crates must be at least twice the number of small crates. However, at least 5 small crates should be used. If the company has available 800 bananas, how many of each crate should the company use to maximize the total number of crates produced?",
        "results": {
            "Maximized total number of crates": "19.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 79,
        "question": "A crepe store sells chocolate and peanut butter crepes. A chocolate crepe requires 3 units of chocolate spread and 6 units of crepe mix. A peanut butter crepe requires 4 units of peanut butter spread and 7 units of crepe mix. Recently, the peanut butter crepe has been more popular and therefore the number of peanut butter crepes made must exceed the number of chocolate crepes made. However at least 25% of the crepes made should be chocolate. The store has available 400 units of chocolate spread and 450 units of peanut butter spread. How many of each should the store make to minimize the total amount of crepe mix needed?",
        "results": {
            "Number of chocolate crepes": "0.0",
            "Number of peanut butter crepes": "0.0",
            "Minimum total amount of crepe mix needed": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 80,
        "question": "A fire department employs regular and emergency fire fighters. A regular fire fighter works 10 hours per shift and earns $300. An emergency fire fighter works 6 hours per shift and earns $100. Due to wildfires in the region, the fire department needs at least 300 hours of fire fighter time. If the fire department has a budget of $7000, how many of each should the fire department hire to minimize the total number of fire fighters?",
        "results": {
            "Number of Regular Fire Fighters": "15.0",
            "Number of Emergency Fire Fighters": "25.0",
            "Minimum Total Number of Fire Fighters": "40.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 81,
        "question": "A mall buys two types of hand sanitizer machines, a motion activated one and a manual one. The motion activated one can deliver 50 drops per minute and consumes 30 kWh. The manual one can deliver 75 drops per minute and consumes 20 kWh. Since the motion activated one is more hygienic, at most 40% of the machines can be manual. In addition, at least 3 should be motion activated. If the mall must be able to deliver at least 1000 drops per minute and can use at most 500 kWh per minute, how many of each machine should they buy to minimize the total number of machines?",
        "results": {
            "Number of motion activated machines": "11.0",
            "Number of manual machines": "6.0",
            "Minimized Total Number of Machines": "17.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 82,
        "question": "A hot dog company can build two types of butcher shops, a small shop and a large shop. A small shop can make 30 hot dogs per day and requires 2 workers. A large shop can make 70 hot dogs per day and requires 4 workers. The company must make at least 500 hot dogs per day but they only have available 30 workers. How many of each butcher shop should the company build to minimize the total number of butcher shops?",
        "results": {
            "Number of Small Shops": "1.0",
            "Number of Large Shops": "7.0",
            "Minimum Total Number of Butcher Shops": "8.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 83,
        "question": "An airport buys two types of vehicles, a 4-wheeler and 3-wheeler, to help move luggage. A 4-wheeler vehicle can move 60 luggage per day and produces 30 units of pollutant per day. A 3-wheeler vehicle can move 40 luggage per day and produces 15 units of pollutant per day. The airport needs to be able to move at least 1000 luggage per day. To avoid over-polluting the airport, they can produce at most 430 units of pollutant per day. How many of each vehicle should the airport buy to minimize the total number of vehicles needed.",
        "results": {
            "Number of 4-wheeler vehicles": "6.0",
            "Number of 3-wheeler vehicles": "16.0",
            "Minimum Total Number of Vehicles Needed": "22.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 84,
        "question": "A scientist is conducting two experiments to produce electricity, experiment alpha and experiment beta. In experiment alpha, 3 units of metal and 5 units of acid are required to produce 8 units of electricity. In experiment beta, 5 units of metal and 4 units of acid are required to produced 10 units of electricity. The lab has 800 units of metal and 750 units of acid available. How many of each experiment should the scientist conduct to maximize the total amount of electricity produced?",
        "results": {
            "Number of Experiment Alpha": "40.0",
            "Number of Experiment Beta": "136.0",
            "Maximized Total Amount of Electricity": "1680.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 85,
        "question": "A man fishes in a 250 acre lake and can catch fish either using a net or fishing line. For each acre of the lake, using a net will catch 8 fish and requires 4 units of bait but also causes 2 units of pain for the fisherman. For each acre of the lake, using a fishing line will catch 5 fish and requires 3 units of bait but also causes 1 unit of pain for the fisherman. The fisherman has available 800 units of bait and can tolerate at most 350 units of pain. For how many acres each should he use each fishing method to maximize the amount of fish he can catch?",
        "results": {
            "Acres using a net": "124.99999999999996",
            "Acres using a fishing line": "100.00000000000009",
            "Maximum amount of fish caught": "1500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 86,
        "question": "A coffee shop sells mochas and regular coffees. Each mocha requires 3 units of coffee powder and 6 units of milk. Each regular coffee requires 6 units of coffee powder and 2 units of milk. The shop has available 400 units of coffee powder and 500 units of milk. Making a mocha takes 5 minutes and making a regular coffee takes 3 minutes. Since mochas are more popular among people, the shop must make at least 3 times as many mochas as regular coffees. How many of each should they make to minimize the total production time?",
        "results": {
            "Number of Mochas": "0.0",
            "Number of Regular Coffees": "-0.0",
            "Minimized Total Production Time": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 87,
        "question": "A butcher shop is buying meat slicers for their shop, a manual and automatic slicer. The manual slicer can cut 5 slices per minute while the automatic slicer can cut 8 slices per minute. In addition, to make sure all the parts operate smoothly, the manual slicer requires 3 units of grease per minute while the automatic slicer requires 6 units of grease per minute. Since the automatic slicer does not need someone to operate it, the number of manual slicers must be less than the number of automatic slicers. In addition, the butcher shop needs to be able to cut at least 50 slices per minute but can use at most 40 units of grease per minute. How many of each slicer should the butcher shop buy to minimize the total number of slicers in the shop?",
        "results": {
            "Number of Manual Slicers": "1.0",
            "Number of Automatic Slicers": "6.0",
            "Minimum Total Number of Slicers": "7.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 88,
        "question": "A water company sells water in glass and plastic bottles. A glass bottle can hole 500 ml of water while a plastic bottle can hold 750 ml of water. Because most customer prefer plastic bottles, the number of plastic bottles must be at least 3 times the number of glass bottles. However, there must be at least 20 glass bottles. If the company has available 250000 ml of water, how many of each bottle should be made to maximize the total number of bottles?",
        "results": {
            "Number of glass bottles": "90.0",
            "Number of plastic bottles": "273.0",
            "Maximized Total Number of Bottles": "363.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 89,
        "question": "An Indian restaurant makes goat and chicken curry. Each bowl of goat curry requires 3 units of goat meat and 6 units of the curry base. Each bowl of chicken curry requires 5 units of chicken meat and 5 units of the curry base. The restaurant has available 1500 units of goat meat and 2000 units of chicken meat. At least 25% of the bowls made must be chicken curry. Since goat curry is more popular, the number of goat curry bowls must be larger than the number of chicken curry bowls. How many of each type of curry bowl should be made to minimize the total amount of curry base used?",
        "results": {
            "Number of goat curry bowls": "0.0",
            "Number of chicken curry bowls": "0.0",
            "Minimized Total Amount of Curry Base Used": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 90,
        "question": "An accounting firm employs part time workers and full time workers. Full time workers work 8 hours per shift while part time workers work 4 hours per shift. In addition, full time workers are paid $300 per shift while part time workers are paid $100 per shift. Currently, the accounting firm has a project requiring 500 hours of labor. If the firm has a budget of $15000, how many of each type of worker should be scheduled to minimize the total number of workers.",
        "results": {
            "Total Number of Workers": "100.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 91,
        "question": "A factory has two machines, A and B. Each day, machine A can make 30 items and consumes 100 kWh. Machine B can make 50 items and consumes 120 kWh per day. The factory must produce at least 1000 items per day and has 3000 kWh of electricity available per day. Since there are not many workers that can operate both machines, at most 30% of the machines must be of type B. Further, at least 5 machines of type A should be used. How many of each machine should be used to minimize the total number of machines?",
        "results": {
            "Number of Machine A": "20.0",
            "Number of Machine B": "8.0",
            "Total Number of Machines": "28.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 92,
        "question": "A toy company can build two factory types, a medium sized factory and a small factory. A medium sized factory can make 50 toys per day and requires 3 operators. A small factory can make 35 toys per day and requires 2 operators. The company must make at least 250 toys per day but they only have available 16 operators. How many of each factory should the company build to minimize the total number of factories?",
        "results": {
            "Number of medium sized factories": "5.0",
            "Number of small factories": "0.0",
            "Minimized Total Number of Factories": "5.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 93,
        "question": "A chemical plant can buy two types of generators, generator A and generator B, which use two different processes to generate hydrogen. Generator A uses an electrolysis process and produces 40 cubic meters of hydrogen as well as 300 units of pollutants every day. Generator B uses a fermentation process to produce 30 cubic meters of hydrogen per day while outputting 200 units of pollutants. The chemical plant must make a minimum of 1000 cubic meters of hydrogen per day but due to environmental restrictions they can produce at most 15000 units of pollutant. How many of each type of generator should they buy to minimize the number of generators needed?",
        "results": {
            "Number of Generator A": "25.0",
            "Number of Generator B": "-0.0",
            "Minimum Number of Generators Needed": "25.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 94,
        "question": "There are two chemical reactions, chemical reaction A and chemical reaction B. Chemical reaction A requires 5 units of rare inert gas and 6 units of treated water to produce 10 units of a rare compound. Chemical reaction B requires 7 units of rare inert gas and 3 units of treater water to produce 8 units of a rare compound. There are 1000 units of the rare inert gas and 800 units of treated water available in the lab. How many reactions of each type should be done to maximize the amount of rare compound produced?",
        "results": {
            "Number of chemical reaction A": "96.0",
            "Number of chemical reaction B": "74.0",
            "Maximized amount of rare compound produced": "1552.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 95,
        "question": "A mining company has available a total of 100 square miles of mining sites and considering the use of two mining techniques: heap leaching and vat leaching. For each square mile of land, heap leaching technique can have a daily production of 3 tons of rare earth oxide per square miles but it also creates 8 tons of polluted wastewater and requires 10 extraction machines. On the other hand, vat leaching technique produces 5 tons of rare earth oxide per square miles per day while creating 17 tons of polluted wastewater and requiring 20 extraction machines. There are 100 machines available and due to environmental regulations, the amount of polluted wastewater must be at most 90 tons daily. Find the square miles of lands (integer) that use each mining technique in order to maximize the daily production of rare earth oxide.",
        "results": {
            "Square miles for heap leaching": "10.0",
            "Square miles for vat leaching": "0.0",
            "Maximized Daily Production of Rare Earth Oxide": "30.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 96,
        "question": "A small chocolate shop makes milk chocolate and dark chocolate bars. Milk chocolate bars require 4 units of cocoa and 7 units of milk. Dark chocolate bars require 6 units of cocoa and 3 units of milk. The shop has 2000 units of cocoa and 1750 units of milk available. In addition since milk chocolate sells better, at least 2 times as many milk chocolate bars need to be made as dark chocolate bars.  If making a milk chocolate bar takes 15 minutes and making a dark chocolate bar takes 12 mins, how many of each should the make to minimize total production time?",
        "results": {
            "Number of milk chocolate bars": "0.0",
            "Number of dark chocolate bars": "-0.0",
            "Minimized Total Production Time (in minutes)": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 97,
        "question": "An office is buying printers for their headquarters, a premium model and regular model. The premium model can print 30 pages per minute while the regular model can print 20 pages per minute. In addition, the premium model requires 4 units of ink per minute while the regular model requires 3 units of ink per minute. The office wants to make sure that at least 200 pages can be printed per minute and that at most 35 units of ink are used per minute.  Since the premium model is more user friendly, the number regular printers must be less than the number of premium printers. How many of each printer should be bought to minimize the total number of printers in the office?",
        "results": {
            "Number of Premium Printers": "7.0",
            "Number of Regular Printers": "0.0",
            "Total Number of Printers": "7.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 98,
        "question": "A vine company sells vine in vintage and regular bottles. A vintage bottle can hold 500 ml of vine while a regular bottle can hold 750 ml of vine. The company has available 100000 ml of vine. Because vintage bottles are mostly bought by collectors, the number of regular bottles must be at least 4 times as much as the number of vintage bottles. However, at least 10 vintage bottles must be made. How many of each should be made to maximize the total number of bottles produced?",
        "results": {
            "Number of Vintage bottles": "28.0",
            "Number of Regular bottles": "114.0",
            "Maximized Total Number of Bottles": "142.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 99,
        "question": "A candy company is making peach flavored candy and cherry flavored candy. Each pack of peach flavored candy requires 3 units of peach flavoring and 5 units of special syrup. Each pack of cherry flavored candy requires 5 units of cherry flavoring and 4 units of special syrup. The company has available 3000 units of peach flavoring and 4000 units of cherry flavoring. Peach candy is much more popular and thus the number of peach candy packs must be larger than the number of cherry candy packs. In addition, at least 30% of the pack must be cherry flavored. How many of each should be made to minimize the total amount of special syrup used?",
        "results": {
            "Number of peach flavored candy packs": "0.0",
            "Number of cherry flavored candy packs": "0.0",
            "Minimum total amount of special syrup used": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 100,
        "question": "A patient in the hospital can take two pills, Pill 1 and Pill 2. Per pill, pill 1 provides 0.2 units of pain medication and 0.3 units of anxiety medication. Per pill, pill 2 provides 0.6 units of pain medication and 0.2 units of anxiety medication. In addition, pill 1 causes 0.3 units of discharge while pill 2 causes 0.1 units of discharge. At most 6 units of pain medication can be provided and at least 3 units of anxiety medication must be provided. How many pills of each should the patient be given to minimize the total amount of discharge?",
        "results": {
            "Number of Pill 1": "5.0",
            "Number of Pill 2": "8.0",
            "Minimized Total Discharge": "2.3000000000000003"
        },
        "type": "linear-notable"
    },
    {
        "index": 101,
        "question": "A man on a strict diet only drinks meal replacement drinks from two brands, alpha and omega. The alpha brand drink contains 30 grams of protein, 20 grams of sugar, and 350 calories per bottle. The omega brand drink contains 20 grams of protein, 15 grams of sugar, and 300 calories per bottle. The man wants to get at least 100 grams of protein and 2000 calories. In addition, because the omega brand drink contains tiny amounts of caffeine, at most 35% of the drink should be omega brand. How many bottles of each should he drink to minimize his sugar intake?",
        "results": {
            "Number of Alpha brand bottles": "4.0",
            "Number of Omega brand bottles": "2.0",
            "Minimized Sugar Intake": "110.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 102,
        "question": "A summer camps does science experiments in two pre filled beakers, beaker 1 and beaker 2. Beaker 1 uses 4 units of flour and 6 units of special liquid to make 5 units of slime. Beaker 2 uses 6 units of flour and 3 units of special liquid to make 3 units of slime.  However, beaker 1 creates 4 units of waste while beaker 2 creates 2 units of waste. The summer camp has available 150 units of flour and 100 units of special liquid. If at most 30 units of waste can be produced, how many of each beaker should be used to maximize the amount of slime produced?",
        "results": {
            "Number of Beaker 1 used": "-0.0",
            "Number of Beaker 2 used": "15.0",
            "Maximized Amount of Slime Produced": "45.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 103,
        "question": "An dog hospital has 2000 units of tooth medication to make both small and large bones. A small bone requires 10 units of tooth medication and 12 units of meat. A large bone requires 15 units of tooth medication and 15 units of meat. Since most dogs prefer the small bones, at least 50% of the bones made must be small. In addition, the hospital must make at least 30 large bones. How many of each bone should be made to minimize the amount of meat needed?",
        "results": {
            "Number of Small Bones": "30.0",
            "Number of Large Bones": "30.0",
            "Minimum Amount of Meat Needed": "810.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 104,
        "question": "A scientist in the arctic needs to get enough vitamin D and vitamin C in his diet by drinking orange and apple juice. Each box of orange juice contains 10 units of vitamin D and 8 units of vitamin C. Each box of apple juice contains 12 units of vitamin D and 6 units of vitamin C. Since the scientist prefers apple juice, he must drink at least 3 times as many apple juice boxes and orange juice boxes. However, he must also drink at least 3 orange juice boxes. To avoid a vitamin C overdose, the scientist can consume at most 300 units of vitamin C. How many of each juice box should he drink to maximize his total vitamin D intake?",
        "results": {
            "Number of orange juice boxes": "3.0",
            "Number of apple juice boxes": "46.0",
            "Maximized Total Vitamin D Intake": "582.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 105,
        "question": "A cleaning company uses a cleansing chemical and odor-removing chemical to clean a house. Each unit of the cleansing chemical takes 4 units to be effective while each unit of the odor-removing chemical takes 6 minutes to be effective. The company must use at least 100 units of the cleansing chemical. In total, at least 300 units of chemicals can be used per house. Further, because the cleansing chemical is strong, there can be at most twice the amount of cleansing chemical as odor-removing chemical. How many units of each should be used to minimize the total time it takes for a house to be cleaned?",
        "results": {
            "Number of units of cleansing chemical": "200.0",
            "Number of units of odor-removing chemical": "100.0",
            "Minimum total time for cleaning": "1400.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 106,
        "question": "A drug company is making allergy pills and fever reducing pills in two factories, factory 1 and factory 2. Factory 1 produces 20 allergy pills and 15 fever reducing pills per hour. Factory 2 produces 10 allergy pills and 30 fever reducing pills per hour.  Factory 1 is much more efficient and only requires 20 units of a rare compound while factory 2 requires 30 units of a rare compound. The company only has available 1000 units of the rare compound. If the company must make at least 700 allergy pills and 600 fever reducing pills, how many hours should each factory be run to minimize the total time needed?",
        "results": {
            "Hours for Factory 1": "34.0",
            "Hours for Factory 2": "3.0",
            "Minimized Total Time": "37.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 107,
        "question": "A doctor recommends her patient eat more fish and chicken to increase her protein and iron intake. Each fish meal contains 10 units of protein and 12 units of iron. Each chicken meal contains 15 units of protein and 8 units of iron. The patient needs to consume at least 130 units of protein and 120 units of iron. Since the chicken meal is less expensive, the patient prefers to consume at least twice as many chicken meals as fish meals. If each fish meal contains 7 units of fat and each chicken meal contains 10 units of fat, how many meals of each should she eat to minimize her fat intake?",
        "results": {
            "Number of fish meals": "4.0",
            "Number of chicken meals": "9.0",
            "Minimized Fat Intake": "118.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 108,
        "question": "A pharmaceutical company makes skin cream in batches, a regular batch and premium batch, to sell to hospitals. The regular batch requires 50 units of medicinal ingredients and 40 units of rehydration product. A premium batch requires 40 units of medicinal ingredients and 60 units of rehydration product. The company has available 3000 units of medicinal ingredients and 3500 units of rehydration product. Since the premium batch sells better, the number of regular batches must be less than the number of premium batches. In addition, the company must make at least 10 regular batches. If a regular batch can treat 50 people and a premium batch can treat 30 people, how many of each batch should be made to maximize the number of people that can be treated?",
        "results": {
            "Number of Regular Batches": "32.0",
            "Number of Premium Batches": "35.0",
            "Maximized Number of People Treated": "2650.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 109,
        "question": "A clinic takes patient blood pressure either using an automatic machine or a manual machine. The automatic machine takes 10 minutes per patient while the manual machine takes 15 minutes per patient. Since the automatic machine frequently breaks, at least twice as many patients must have their blood pressure taken by the manual machine than the automatic machine. However, at least 20 patient can be processed by the automatic machine. If the clinic is open for 20000 minutes, maximize the number of patients whose blood pressure can be taken.",
        "results": {
            "Number of patients processed by automatic machine": "500.0",
            "Number of patients processed by manual machine": "1000.0",
            "Maximized Number of Patients": "1500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 110,
        "question": "A patient with a sore throat can drink two syrups, syrup 1 and syrup 2 for treatment. Per serving, syrup 1 delivers 0.5 units of medicine to the throat and 0.4 units of medicine to the lungs. Per serving, syrup 2 delivers 0.2 units of medicine to the throat and 0.5 units of medicine to the lungs. Furthermore, syrup 1 contains 0.5 units of sugar while syrup 2 contains 0.3 units of sugar per serving. The patient can get at most 5 units of medicine for the throat and at least 4 units of medicine to the lungs. How many servings of each should the patient take to minimize his sugar intake?",
        "results": {
            "Number of servings of Syrup 1": "-0.0",
            "Number of servings of Syrup 2": "8.0",
            "Minimized Sugar Intake": "2.4000000000000004"
        },
        "type": "linear-notable"
    },
    {
        "index": 111,
        "question": "A sailor can eat either a crab cakes or a lobster roll for his meals. He needs to ensure he gets at least 80 units of vitamin A and 100 units of vitamin C. Each crab cake contains 5 units of vitamin A and 7 units of vitamin C. Each lobster roll contains 8 units of vitamin A and 4 units of vitamin C. In addition, since lobster is more expensive, at most 40% of his meals should be lobster rolls. If each crab cake contains 4 units of unsaturated fat and each lobster roll contains 6 units of unsaturated fat, how many of each should he eat to minimize his unsaturated fat intake?",
        "results": {
            "Number of Crab Cakes": "16.0",
            "Number of Lobster Rolls": "0.0",
            "Minimized Unsaturated Fat Intake": "64.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 112,
        "question": "A science show preforms two different demonstrations, demonstration 1 and demonstration 2. In demonstration 1, 10 units of mint and 20 units of the active ingredient is used to make 25 units of minty foam. In demonstration 2, 12 units of mint and 15 units of the active ingredient is used to make 18 units of minty foam. In addition, demonstration 1 creates 5 units of black tar while demonstration 2 creates 3 units of black tar. The show has available 120 units of mint and 100 units of active ingredients. If at most 50 units of black tar can be produced, how many of each demonstration should be done to maximize the amount of minty foam produced?",
        "results": {
            "Number of Demonstration 1": "5.0",
            "Number of Demonstration 2": "0.0",
            "Maximized Amount of Minty Foam Produced": "125.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 113,
        "question": "A lab has 20000 mg of mRNA anti-viral available to make children's and adult vaccines. Each children's vaccine contains 50 mg of mRNA and 50 mg of fever suppressant. Each adult vaccine contains 75 mg of mRNA and 75 mg of fever suppressant. Since adult vaccines are more essential, at least 70% of vaccines should be adult vaccines. However, at least 50 children's vaccines should be made. How many of each vaccine should be made to minimize the amount of fever suppressant used?",
        "results": {
            "Number of children's vaccines": "50.0",
            "Number of adult vaccines": "117.0",
            "Minimized amount of fever suppressant used": "11275.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 114,
        "question": "A parent feeds their baby two flavors of baby food, apple and carrot, in order to meet the babies fat and folate requirements. Each serving of apple flavored baby food contains 2 units of fat and 5 units of folate. Each serving of carrot flavored baby food contains 4 units of fat and 3 units of folate. The baby does not like the carrot flavor, and therefore he must eat at least three times as many apple flavored baby food as carrot flavored baby food. However, he must eat at least 2 servings of carrot flavored baby food. If the baby can consume at most 100 units of folate, how many servings of each should he eat to maximize his fat intake?",
        "results": {
            "Number of servings of apple flavored baby food": "17.0",
            "Number of servings of carrot flavored baby food": "5.0",
            "Maximized Fat Intake": "54.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 115,
        "question": "Both fertilizer and seeds need to be added to a lawn. One unit of fertilizer takes 0.5 minutes to be effective while one unit of seeds takes 1.5 minutes to be effective. There can be at most 300 units of fertilizer and seeds combined added to the lawn. In addition at least 50 units of fertilizer need to be added. Since the lawn is really patchy, there can be at most twice the amount of fertilizer as seeds. How many units of each should be added to minimize the total time it takes for the lawn to be ready?",
        "results": {
            "Number of units of Fertilizer": "50.0",
            "Number of units of Seeds": "25.0",
            "Minimum Total Time": "62.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 116,
        "question": "A pharmacy has two factories, factory 1 and factory 2, where they make acne cream and anti-bacterial cream. Factory 1 produces 12 units of acne cream and 15 units of anti-bacterial cream per hour. Factory 2 produces 20 units of acne cream and 10 units of anti-bacterial cream per hour. Factory 1 requires 30 units of base gel per hour while factory 2 requires 45 units of base gel per hour. The pharmacy has available 5000 units of base gel. Further, they must make at least 800 units of acne cream and 1000 units of anti-bacterial cream. How many hours (integer) should each factory be run to minimize the total time needed?",
        "results": {
            "Hours for Factory 1": "67.0",
            "Hours for Factory 2": "-0.0",
            "Minimized Total Time": "67.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 117,
        "question": "A doctor recommends that a man eat burgers and pizza in order to put on weight. Each burger contains 10 units of fat and 300 calories. Each slice of pizza contains 8 units of fat and 250 calories. The man must get at least 130 units of fat and 3000 calories. Further, each burger contains 12 units of cholesterol while each slice of pizza contains 10 units of cholesterol. Since burgers are slightly more expensive, the man decides to eat at least twice as many slices of pizza as burgers. How many of each should he eat to minimize his cholesterol intake?",
        "results": {
            "Number of Burgers": "5.0",
            "Number of Slices of Pizza": "10.0",
            "Minimized Cholesterol Intake": "160.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 118,
        "question": "A clinic makes batches of vitamin shots and pills. Each batch of vitamin shots requires 30 units of vitamin C and 40 units of vitamin D. Each batch of vitamin pills requires 50 units of vitamin C and 30 units of vitamin D. Since pills are more popular, the number of batches of vitamin pills must be larger than the number of batches of vitamin shots. Further, the clinic can make at most 10 batches of vitamin shots. The clinic has available 1200 units of vitamin C and 1500 units of vitamin D. If each batch of vitamin shots can supply 10 people and each batch of vitamin pills can supply 7 people, how many batches of each should be made to maximize the number of people that can be supplied?",
        "results": {
            "Number of batches of vitamin shots": "10.0",
            "Number of batches of vitamin pills": "18.0",
            "Maximized number of people supplied": "226.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 119,
        "question": "A doctor's office takes the  temperature of patients one by one either by using an electronic or regular thermometer. The electronic thermometer takes 3 minutes to make a reading while the regular thermometer takes 2 minutes to make a reading. Since the electronic thermometer is more accurate, at least twice as many patients should have their temperature checked by the electronic thermometer than the regular thermometer. Since the electronic thermometer has a cooldown time, at least 50 patients should have their temperature checked by a regular thermometer. If the office is open for 15000 minutes, maximize the number of patients whose temperature can be taken?",
        "results": {
            "Number of patients checked by the electronic thermometer": "3750.0",
            "Number of patients checked by the regular thermometer": "1875.0",
            "Maximized number of patients": "5625.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 120,
        "question": "A patient can be hooked up to two machines to have medicine delivered, machine 1 and machine 2. Machine 1 delivers 0.5 units of medicine to the heart per minute and 0.8 units of medicine per minute to the brain. Machine 2 delivers 0.3 units of medicine per minute to the heart and 1 unit of medicine per minute to the brain. In addition however, machine 1 creates 0.3 units of waste per minute while machine 2 creates 0.5 units of waste per minute. If at most 8 units of medicine can be received by the heart and at least 4 units of medicine should be received by the brain, how many minutes should each machine be used to minimize the total amount of waste produced?",
        "results": {
            "Minutes for machine 1": "5.0",
            "Minutes for machine 2": "0.0",
            "Minimized Total Waste": "1.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 121,
        "question": "A travelling salesman only eats ramen and fries. Each pack of ramen contains 400 calories, 20 grams of protein, and 100 mg of sodium. Each pack of fries contains 300 calories, 10 grams of protein, and 75 mg of sodium. Since fries are easier to eat while driving, at most 30% of his meals can be ramen. The salesman wants to ensure he eats at least 3000 calories and 80 grams of protein. How many of each should he eat to minimize his sodium intake?",
        "results": {
            "Number of packs of Ramen": "0.0",
            "Number of packs of Fries": "10.0",
            "Minimized Sodium Intake": "750.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 122,
        "question": "A science store makes two boxes, a cheap and expensive box. The cheap box contains 3 units of metal and 5 units of acid which can be mixed to create 8 units of foam. The expensive box contains 5 units of metal and 8 units of acid which can be mixed to create 10 units of foam. The cheap box however gives off 2 units of heat while the expensive box gives off 3 units of heat. The science store has available 200 units of metal and 300 units of acid. If at most 50 units of heat can be given off, how many of each box should the store make to maximize the amount of foam produced?",
        "results": {
            "Number of Cheap Boxes": "25.0",
            "Number of Expensive Boxes": "0.0",
            "Maximized Amount of Foam Produced": "200.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 123,
        "question": "A pharmacy has 3000 mg of morphine to make painkillers and sleeping pills. Each painkiller pill requires 10 mg of morphine and 3 units of digestive medicine. Each sleeping pill requires 6 mg of morphine and 5 units of digestive medicine. The pharmacy needs to make at least 50 painkiller pills. Since sleeping pills are more popular, at least 70% of the pills should be sleeping pills. How many of each should the pharmacy make to minimize the total amount of digestive medicine needed?",
        "results": {
            "Number of painkiller pills": "50.0",
            "Number of sleeping pills": "117.0",
            "Minimized Total Amount of Digestive Medicine Needed": "735.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 124,
        "question": "A boy needs to get enough magnesium and zinc in his diet by eating chewable gummies and taking pills. Each gummy contains 3 units of magnesium and 4 units of zinc. Each pill contains 2 units of magnesium and 5 units of zinc. The boy must take at least 10 pills. Since he prefers gummies more, he must eat at least 3 times the amount of gummies as pills. If the boy can consume at most 200 units of magnesium, how many of each should he eat to maximize his zinc intake?",
        "results": {
            "Number of gummies": "54.0",
            "Number of pills": "18.0",
            "Maximized Zinc Intake": "306.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 125,
        "question": "A patient takes anxiety medication and anti-depressants one after the other. Each unit of anxiety medication takes 3 minutes to be effective while each unit of anti-depressant takes 5 minutes to be effective. The patient must take at least 100 units of medication and at least 30 should be anxiety medication. Since the anxiety medication is strong, the patient can take at most twice the amount of anxiety medication as anti-depressants. How many units of each should the patient take to minimize the total time it take for the medication to be effective?",
        "results": {
            "Units of anxiety medication (x)": "66.0",
            "Units of anti-depressants (y)": "34.0",
            "Minimum total time for medication to be effective": "368.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 126,
        "question": "A pharmacy makes eye cream and foot cream using two different machines, machine 1 and machine 2. Machine 1 can  make 30 ml of eye cream and 60 ml of foot cream per hour. Machine 2 can make 45 ml of eye cream and 30 ml of foot cream per hour. Furthermore, machine 1 requires 20 ml of distilled water per hour while machine 2 requires 15 ml of distilled water per hour. The pharmacy has available 1200 ml of distilled water. The usage time of the machines is integer in hours. If the pharmacy needs to make at least 1300 ml of eye cream and 1500 ml of foot cream, how many hours should each machine be used to minimize the total time needed?",
        "results": {
            "Hours for Machine 1": "16",
            "Hours for Machine 2": "19",
            "Minimized Total Time Needed": "35"
        },
        "type": "linear-notable"
    },
    {
        "index": 127,
        "question": "A woman eats cashews and almonds to get her calorie and protein intake. A serving of almonds contains 200 calories and 20 grams of protein. A serving of cashews contains 300 calories and 25 grams of protein. The woman decides to eat at least twice as many servings of almonds as cashews. Furthermore, a serving of almonds contains 15 grams of fat while a serving of cashews contains 12 grams of fat. If the woman needs to consume at least 10000 calories and 800 grams of protein this week, how many servings of each should she eat to minimize her fat intake?",
        "results": {
            "Number of servings of almonds": "29.0",
            "Number of servings of cashews": "14.0",
            "Minimized Fat Intake": "603.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 128,
        "question": "A company make both liquid and foam hand sanitizer. Liquid hand sanitizer requires 40 units of water and 50 units of alcohol. Foam hand sanitizer requires 60 units of water and 40 units of alcohol. The company has available 2000 units of water and 2100 units of alcohol. The number of foam hand sanitizers made must exceed the number of liquid hand sanitizers. In addition, at most 30 liquid hand sanitizers can be made. If each liquid hand sanitizer can clean 30 hands and each foam hand sanitizer can clean 20 hands, how many of each should the company make to maximize the number of hands that can be cleaned?",
        "results": {
            "Number of Liquid Hand Sanitizers": "19.0",
            "Number of Foam Hand Sanitizers": "20.0",
            "Maximized Number of Hands Cleaned": "970.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 129,
        "question": "A clinic is conducting a throat or nasal swabs on each patient. A throat swab takes 5 minutes while a nasal swab takes 3 minutes. The clinic must administer at least 30 nasal swabs. Since the nasal swab is more uncomfortable, at least 4 times as many throat swabs must be done as nasal swabs. If the clinic is only operational for 20000 minutes, how many of each swab should be done to maximize the number of patients seen?",
        "results": {
            "Number of throat swabs": "3478.0",
            "Number of nasal swabs": "869.0",
            "Maximized Number of Patients Seen": "4347.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 130,
        "question": "A patient in the hospital can take two different pain killers, pain killer 1 and pain killer 2. Per dose, pain killer 1 delivers 0.5 units of medicine to the legs and 0.8 units of medicine to the back. Per dose, pain killer 2 delivers 0.7 units of medicine to the legs and 0.4 units of medicine to the back. In, addition pain killer 1 deliver 0.3 units of sleeping medicine and pain killer 2 delivers 0.6 units of sleeping medicine. At most 8 units of sleep medicine should be delivered and at least 4 units of medicine should be delivered to the legs. How many doses of each should be taken to maximize the amount of medicine delivered to the back?",
        "results": {
            "Doses of Pain Killer 1": "26.0",
            "Doses of Pain Killer 2": "0.0",
            "Maximized Medicine to the Back": "20.8"
        },
        "type": "linear-notable"
    },
    {
        "index": 131,
        "question": "A zookeeper feeds a gorilla with bananas and mangoes. Each banana contains 80 calories, 20 grams of potassium, and 10 grams of sugar. Each mango contains 100 calories, 15 grams of potassium, and 8 grams of sugar.  The gorilla must consume at least 4000 calories and 150 grams of potassium. Since the gorilla prefers bananas, at most 33% of the fruits he eats can be mangoes. If excess sugar makes the gorilla aggressive, how many of each fruit should he consume to minimize his sugar intake?",
        "results": {
            "Number of Bananas": "32.0",
            "Number of Mangoes": "15.0",
            "Minimized Sugar Intake": "440.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 132,
        "question": "In a science club, there are two tables that can be set up to make slime. At table 1, 3 units of powder and 5 units of glue are used to make 4 units of slime. At table 2, 8 units of powder and 6 units of glue are used to make 5 units of slime. However, table 1 produces 2 units of mess while table 2 produces 4 units of mess. The science club has available 100 units of powder and 90 units of glue.  If at most 30 units of mess can be made, how many of each table should be set up to maximize the amount of slime produced?",
        "results": {
            "Number of Table 1 setups": "15.0",
            "Number of Table 2 setups": "0.0",
            "Maximized Amount of Slime Produced": "60.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 133,
        "question": "A pharmaceutical company has 800 units of painkiller medicine and makes daytime and nighttime painkiller. A daytime pill has 6 units of painkiller medicine and 2 units of sleep medicine. A nighttime pill has 5 units of painkiller medicine and 5 units of sleep medicine. Since some people don’t want the sleeping effect, at least 40% of the pills must be daytime pills. However at least 50 nighttime pills must be made. How many of each pill should be made to minimize the total amount of sleep medicine required?",
        "results": {
            "Number of daytime pills": "34.0",
            "Number of nighttime pills": "50.0",
            "Minimum Total Amount of Sleep Medicine Required": "318.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 134,
        "question": "A competitive eater challenges himself to eat slices of cheesecake and caramel cake. Each slice of cheesecake contains 200 calories and 40 grams of sugar. Each slice of caramel cake contains 250 calories and 50 grams of sugar. He prefers cheesecake and decides to eat at least 3 times as many slices of cheesecake as caramel cake. However, he must also eat at least 3 slices of caramel cake. If he can consume at most 10000 calories in one day, how many slices of each cake should he eat to maximize the total amount of sugar he consumes?",
        "results": {
            "Number of slices of cheesecake": "45.0",
            "Number of slices of caramel cake": "4.0",
            "Maximized Total Amount of Sugar": "2000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 135,
        "question": "Both sulfate and ginger need to be added to a shampoo. One unit of sulfate takes 0.5 minutes to be effective while one unit of ginger takes 0.75 minutes to be effective. The shampoo must contain at least 100 units of sulfates and at least a total of 400 units of both ingredient. Since too much sulfate can damage the hair, there can be at most twice the amount of sulfate as ginger in the shampoo. How many units of each should be added to the shampoo to minimize the total amount of time it takes for the mixture to be effective? (Note: one must be added before the other)",
        "results": {
            "Units of sulfate": "266.0",
            "Units of ginger": "134.0",
            "Minimum Effective Time": "233.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 136,
        "question": "A pharmaceutical company has two labs, lab 1 and lab 2, where they make heart and lung medication in pill form. At lab 1, they can produce 20 heart medication pills and 30 lung medication pills per session. At lab 2, they can produce 30 heart medication pills and 40 lung medication pills per session. Each session at lab 1 requires 3 hours of worker labor while each session at lab 2 requires 5 hours of worker labor. The company has 3000 worker hours available and must make at least 20000 heart medication pills and at least 30000 lung medication pills. How many sessions at each lab should be run to minimize the total sessions needed?",
        "results": {
            "Number of sessions at Lab 1": "1000.0",
            "Number of sessions at Lab 2": "-0.0",
            "Minimized Total Sessions": "1000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 137,
        "question": "A doctor suggests that his patient eat oranges and grapefruit to meet his vitamin C and vitamin A requirements. One orange contains 5 units of vitamin C, 3 units of vitamin A, and 5 grams of sugar. One grapefruit contains 7 units of vitamin C, 5 units of vitamin A, and 6 grams of sugar. The patient must get at least 80 units of vitamin C and 70 units of vitamin A. Since the patent prefers oranges, he must eat at least 2 times as many oranges as grapefruit. How many of each should he eat to minimize his sugar intake?",
        "results": {
            "Number of oranges": "15.0",
            "Number of grapefruits": "4.999999999999999",
            "Minimized Sugar Intake": "105.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 138,
        "question": "A university research lab can make two types of diabetes medicine, medicine A and medicine B. Per dose, medicine A takes 30 units of imported material and 50 units of mRNA to make. Per dose, medicine B takes 40 units of imported material and 30 units of mRNA to take. The lab has available at most 300 units of imported material and 400 units of mRNA. The lab can make at most 5 doses of medicine A and the number of doses of medicine B must be larger than the number of dosed of medicine A. If one dose of medicine A can treat 12 people and one dose of medicine B can treat 8 people, how many doses of each should be made to maximize the number of people that can be treated?",
        "results": {
            "Number of doses of medicine A": "3.0",
            "Number of doses of medicine B": "5.0",
            "Maximized Number of People Treated": "76.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 139,
        "question": "A popup clinic is doing virus testing with either spit tests or swabs. A spit test takes 10 minutes to administer while a  swab takes 15 minutes to administer. Since the spit test is more accurate, at least twice as many spit tests should be given as  swabs. However, at least 20  swabs must be administers. If the popup clinic operates for 8000 minutes, maximize the number of tests that can be administered.",
        "results": {
            "Number of spit tests": "770.0",
            "Number of swabs": "20.0",
            "Maximized Number of Tests": "790.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 140,
        "question": "A patient is undergoing radiation treatment involving two beams, Beam 1 and Beam 2. Beam 1 delivers a dose of 0.3 units of medicine per minute to the benign area of the pancreas and 0.2 units of medicine per minute to the benign area of the skin. Beam 2 delivers 0.2 units of medicine per minute to the benign area of the pancreas and 0.1 units of medicine per minute to the benign area of the skin.  In addition, beam 1 delivers 0.6 units of medicine per minute to the tumor and beam 2 delivers 0.4 units of medicine per minute to the tumor. At most 4 units of medicine should be received by the skin and at least 3 units of medicine should be delivered to the tumor.  How many minutes of each beam should be used to minimize the total radiation received by the pancreas?",
        "results": {
            "Minutes of Beam 1": "5.0",
            "Minutes of Beam 2": "0.0",
            "Minimum Total Radiation to the Pancreas": "1.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 141,
        "question": "A body builder buys pre prepared meals, a turkey dinner and a tuna salad sandwich. The turkey dinner contains 20 grams of protein, 30 grams of carbs, and 12 grams of fat. The tuna salad sandwich contains 18 grams of protein, 25 grams of carbs, and 8 grams of fat. The bodybuilder wants to get at least 150 grams of protein and 200 grams of carbs. In addition because the turkey dinner is expensive, at most 40% of the meals should be turkey dinner. How many of each meal should he eat if he wants to minimize his fat intake?",
        "results": {
            "Number of Turkey Dinners": "0.0",
            "Number of Tuna Salad Sandwiches": "9.0",
            "Minimized Fat Intake": "72.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 142,
        "question": "A chemistry teacher teaches her students two experiments, experiment 1 and experiment 2. In experiment 1, 3 units of the red liquid and 4 units of the blue liquid mix to create 5 units of green gas. In experiment 2, 5 units of the red liquid and 3 units of the blue liquid mix to create 6 units of the green gas. In addition, experiment 1 produces 1 units of smelly gas while experiment 2 produces 2 units of smelly gas.  The lab has available 80 units of red liquid and 70 units of blue liquid. If at most 10 units of smelly gas can be produced, how many experiments of each should be done to maximize the total amount of green gas produced?",
        "results": {
            "Number of Experiment 1": "10.0",
            "Number of Experiment 2": "-0.0",
            "Maximized Total Amount of Green Gas Produced": "50.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 143,
        "question": "A lab has 1000 units of medicinal ingredients to make two pills, a large pill and a small pill. A large pill requires 3 units of medicinal ingredients and 2 units of filler. A small pill requires 2 units of medicinal ingredients and 1 unit of filler. The lab has to make at least 100 large pills. However, since small pills are more popular at least 60% of the total number of pills must be small. How many of each should be made to minimize the total number of filler material needed?",
        "results": {
            "Number of Large Pills": "100.0",
            "Number of Small Pills": "150.0",
            "Minimized Total Number of Filler Material Needed": "350.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 144,
        "question": "Both chorine and water softener need to be added to a pool. One unit of chlorine takes 1 minute to be effective while one unit of water softener takes 2 minutes to be effective. Because too much chlorine can burn your eyes, there has to at most half as much chlorine as water softener in the pool. If there has to be at least 200 units of chlorine in the water and at least a total of 500 units of chemicals in the water, how many units of each should be added to minimize the total time it takes for the pool to be ready? (Note: chlorine must be added before water softener or vice versa).",
        "results": {
            "Number of units of Chlorine": "200.0",
            "Number of units of Water Softener": "400.0",
            "Minimum Total Time": "1000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 145,
        "question": "A drug company is making pain killers and sleeping pills using two processes, process 1 and process 2. Process 1 produces 35 units of pain killers and 12 units of sleeping pills per hour. Process 2 produces 50 units of pain killers and 30 units of sleeping pills per hour. Process 1 requires 50 units of preliminary material while process 2 requires 60 units of preliminary material. The drug company has available 2500 units of preliminary material and must make at least 1200 units of pain killers and 1200 units of sleeping pills. How many of each process should be run to minimize the total time needed?",
        "results": {
            "Hours for Process 1": "0.0",
            "Hours for Process 2": "40.0",
            "Minimized Total Time": "40.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 146,
        "question": "A dietician recommends her client eat blueberries and strawberries to meet her anti-oxidant and mineral requirement. A pack of blueberries contains 3 units of anti-oxidants and 5 units of minerals. A pack of strawberries contains 1 unit of anti-oxidants and 7 units of minerals. The client must get at least 90 units of anti-oxidants and 100 units of minerals. In addition, because blueberries are not in season, the dietician recommend she eats at least 3 times as many packs of strawberries as blueberries. If a pack of blueberries contains 5 grams of sugar and a pack of strawberries contains 7 grams of sugar, how many of packs of each should she consume to minimize her sugar intake?",
        "results": {
            "Number of packs of blueberries": "15.0",
            "Number of packs of strawberries": "45.0",
            "Minimized Sugar Intake": "390.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 147,
        "question": "An engineering school has a bridge building competition where students must build as many beam bridges and truss bridges as they can using Popsicle sticks and glue. A beam bridge requires 30 Popsicle sticks and 5 units of glue while a truss bridge requires 50 Popsicle sticks and 8 units of glue. Each team has at most 600 Popsicle sticks and 100 units of glue. In addition, each team can build at most 5 truss bridges and the number of beam bridges must be larger than the number of truss bridges. If a beam bridge can hold 40 grams and a truss bridge can hold 60 grams, how many of each bridge should a team build to maximize the total mass that can be supported?",
        "results": {
            "Number of Beam Bridges": "20.0",
            "Number of Truss Bridges": "0.0",
            "Maximized Total Mass Supported": "800.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 148,
        "question": "A clinic administers two vaccines available for the public to take one at a time. One vaccine is taken as a pill and another is taken as a shot. The pill vaccine takes 10 minutes to administer while the shot takes 20 minutes to administer. Since the shot has been more thoroughly studied, the clinic must deliver at least 3 times as many shots as pill. In addition, the clinic must administer at least 30 pill vaccines. If the clinic only operates for 10000 minutes, maximize the number of patients that can be vaccinated.",
        "results": {
            "Number of pill vaccines": "142.0",
            "Number of shot vaccines": "429.0",
            "Maximized number of patients vaccinated": "571.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 149,
        "question": "A chocolate company can transport their boxes of chocolate either using their own vans or by renting trucks. Their vans can transport 50 boxes per trip while a truck can transport 80 boxes per trip. Since they own their vans, the cost per van trip is $30 while the cost per truck trip is $50. The company needs to transport at least 1500 boxes of chocolate and they have a budget of $1000. Since the vans also provide advertising, the number of trips by van must be larger than the number of trips by trucks. How many of trip by each should be done to minimize the total number of trips?",
        "results": {
            "Number of van trips": "12.0",
            "Number of truck trips": "12.0",
            "Total number of trips": "24.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 150,
        "question": "A bee farmer transports his honey in small and large bottles. A small bottle can take 5 units of honey while a large bottle can take 20 units of honey. The farmer has available at most 300 small bottles and at most 100 large bottles. In addition, since small bottles are easier to sell, at least twice as many small bottles must be used than large bottles. Finally, he can transport at most 200 bottles total and at least 50 must be large bottles. How many of each bottle should be use to maximize the total amount of honey he can transport?",
        "results": {
            "Number of small bottles": "134.0",
            "Number of large bottles": "66.0",
            "Maximized total amount of honey": "1990.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 151,
        "question": "An international goods exporter uses ships and planes to transport goods. A ship can take 40 containers worth of goods and uses 500 liters of fuel per trip. A plane can take 20 containers worth of goods and uses 300 liters of fuel per trip. The company needs to transport at least 500 containers worth of goods. In addition, there can be at most 10 plane trips made and a minimum of 50% of the trips made must be by ship. How many of each trip should be made to minimize the total amount of fuel consumed?",
        "results": {
            "Number of ship trips": "12.0",
            "Number of plane trips": "1.0",
            "Minimum total amount of fuel consumed": "6300.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 152,
        "question": "There has been an oil spill in the ocean and ducks need to be taken to shore to be cleaned either by boat or by canoe. A boat can take 10 ducks per trip while a canoe can take 8 ducks per trip. Since the boats are motor powered, they take 20 minutes per trip while the canoes take 40 minutes per trip. In order to avoid further environmental damage, there can be at most 12 boat trips and at least 60% of the trips should be by canoe. If at least 300 ducks need to be taken to shore, how many of each transportation method should be used to minimize the total amount of time needed to transport the ducks?",
        "results": {
            "Number of boat trips": "12.0",
            "Number of canoe trips": "23.0",
            "Minimum Total Time Needed": "1160.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 153,
        "question": "A soda company sends bottles of their soda to stores around the city in old and new vans. An old van can take 100 soda bottles while a new van can take 80 soda bottles. An old van produces 50 units of pollution while a new van only produces 30 units of pollution. The company needs to send at least 5000 bottles. In addition, at most 30 new vans can be used. How many of each van should be used to minimize the total amount of pollution produced?",
        "results": {
            "Number of old vans": "26.0",
            "Number of new vans": "30.0",
            "Minimized Total Pollution": "2200.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 154,
        "question": "A lawn mowing service provides neighborhood services using small teams and large teams. A small team requires 3 employees and can mow 50 sq ft of lawn. A large team requires 5 employees and can mow 80 sq ft of lawn. The company has 150 employees available. Because most people have smaller lawns in the city, the number of small teams must be at least 3 times as much as the number of large teams. In addition, to make sure the company can meet all demands, there has to be at least 6 large teams and at least 10 small teams. How many of each team type should be used to maximize the amount of lawn that can be mowed?",
        "results": {
            "Number of Small Teams": "40.0",
            "Number of Large Teams": "6.0",
            "Maximized Lawn Area Mowed": "2480.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 155,
        "question": "An aquarium does shows using otters and dolphins. An otter will do 3 tricks at a time and requires 3 treats to do so. A dolphin will do 1 trick at a time and requires 5 treats to do so. Since dolphins are more popular, at least 10 dolphins must be used and at most 30% of the performers can be otters. If the aquarium only has 200 treats available, maximize the total number of tricks that can be preformed.",
        "results": {
            "Number of Otters": "13.0",
            "Number of Dolphins": "32.0",
            "Maximized Total Number of Tricks": "71.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 156,
        "question": "A shoe company supplies shoes to stores via vans and trucks. A van can transport 50 pairs of shoes while a truck can transport 100 pairs of shoes. The company must supply a minimum of 2000 pairs of shoes around the city. Since most stores are small, the number of trucks used cannot exceed the number of vans used.  Find the minimum number of vans that can be used?",
        "results": {
            "Minimum number of vans used": "14.0",
            "Number of trucks used": "14.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 157,
        "question": "An oil and gas company is sending their oil to the port using containers and trucks. A container can hold 30 units of oil while a truck can hold 40 units of oil. Due to government restrictions, the number of trucks used has to at most half the number of containers used. If at least 2000 units of oil need to be sent to the port and at least 15 containers need to be used, minimize the total number of containers and trucks needed.",
        "results": {
            "Number of Containers": "40.0",
            "Number of Trucks": "20.000000000000004",
            "Minimized Total Number of Containers and Trucks": "60.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 158,
        "question": "A school is organizing a field trip to a science center and wants to hire small buses and large buses. A small bus can carry 20 students while a large bus can carry 50 students.  The school needs to provide transportation for at least 500 students.  In addition, since the parking lot is rather small, a maximum of 20% of the buses can be large buses. How many of each type of bus should be hired to minimize the total number of buses?",
        "results": {
            "Number of small buses": "16.0",
            "Number of large buses": "4.0",
            "Minimized Total Number of Buses": "20.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 159,
        "question": "A meat shop ships their burger patties using refrigerated trucks and vans. Each truck can take 1000 patties at a cost of $300 per trip. Each van can take 500 patties at a cost of $100 per trip. Because the trucks have difficulty moving around in the city, the number of trucks must not exceed the number of vans. The meat shop has to ship at least 50000 patties and they have a budget of $12500. How should they plan their shipment to minimize the total number of trips?",
        "results": {
            "Number of Trucks": "25.0",
            "Number of Vans": "50.0",
            "Total Number of Trips": "75.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 160,
        "question": "A florist transports his flowers to stores in small bouquets and large bouquets. A small bouquet has 5 flowers while a large bouquet has 10 flowers. The florist can transport at most 80 small bouquets and 50 large bouquets. In total, he can transport at most 70 bouquets and he must transport at least 20 large bouquets. Since small bouquets are more popular, he must transport at least twice as many small bouquets as large bouquets. How many of each bouquet should he transport to maximize the total number of flowers that reach the stores?",
        "results": {
            "Number of small bouquets": "47.0",
            "Number of large bouquets": "23.0",
            "Maximized Total Number of Flowers": "465.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 161,
        "question": "A toy store decides to deliver gifts using two shipping companies, a new one and an old one. The new company can deliver 50 gifts per trip while the old company can deliver 70 gifts per trip. The new company uses 30 liters of diesel per trip while the old company uses 40 liters of diesel per trip. The toy store needs to deliver at least 1000 gifts. There can be at most 15 trips made by the new company. In order to make sure that the old company does not go out of business, at least 40% of all trips must be made by the old company. How many trips should each company make to minimize the total amount of diesel used?",
        "results": {
            "Number of trips by the new company": "2.0",
            "Number of trips by the old company": "13.0",
            "Minimum total amount of diesel used": "580.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 162,
        "question": "A zoo needs to transport their monkeys to the vet either by bus or by car. A bus can transport 20 monkeys per trip and takes 30 minutes. A car can transport 6 monkeys per trip and takes 15 minutes. There can be at most 10 bus trips. In addition, since the monkeys get aggressive when there are too many in one place at least 60% of the trips should be by car. If the zoo needs to transport 300 monkeys, how many trips of each should be done to minimize the total time required to transport the monkeys?",
        "results": {
            "Number of bus trips": "10.0",
            "Number of car trips": "17.0",
            "Minimized Total Time": "555.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 163,
        "question": "A farmer decides to move his cows to a nearby farm using helicopters and trucks. A helicopter can take 3 cows per trip and creates 5 units of pollution. A truck can take 7 cows per trip and creates 10 units of pollution. The farmer needs to transport 80 cows and he only has enough money for at most 8 truck trips. How many of each type of trip should be taken to minimize the total amount of pollution produced?",
        "results": {
            "Number of Helicopter trips": "8.0",
            "Number of Truck trips": "8.0",
            "Minimized Total Pollution": "120.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 164,
        "question": "A sand company delivers sand for playgrounds in small and large containers. A small container requires 1 person to unload and can hold 20 units of sand. A large container requires 3 people to unload and can hold 50 units of sand. Since most playgrounds are small, the number of small containers used must be at least thrice the number of large containers used. In addition, there must be at least 5 small containers and 3 large containers used. If the company has 100 people available, maximize the amount of sand that they can deliver.",
        "results": {
            "Number of small containers": "91.0",
            "Number of large containers": "3.0",
            "Maximized amount of sand delivered": "1970.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 165,
        "question": "A meal service company delivers meals to customers either on electric bikes or scooters. A bike can hold 8 meals and requires 3 units of charge. A scooter can hold 5 meals and requires 2 units of charge. Since the city is more friendly towards scooters, at most 30% of the electric vehicles can be bikes and at least 20 scooters must be used. If the company only has 200 units of charge available, how many of each vehicle should be used to maximize the number of meals that can be delivered?",
        "results": {
            "Number of Bikes": "26.0",
            "Number of Scooters": "61.0",
            "Maximized Number of Meals Delivered": "513.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 166,
        "question": "A car manufacturer ships their cars on large and small planes. A large plane can carry 30 cars while a small plane can carry 10 cars. Since large planes cause more pollution, the number of large planes must be less than the number of small planes. If the manufacturer wants to deliver at least 300 cars, find the minimum number of planes that can be used.",
        "results": {
            "Number of large planes": "7.0",
            "Number of small planes": "9.0",
            "Minimum number of planes used": "16.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 167,
        "question": "A mine sends ore to the surface in small and large wagons. A small wagon hold 20 units of ore while a large wagon holds 50 units of ore. To avoid taking up too much space on the ramps, the number of small wagons must be at least twice as much as the number or large wagons. In addition, at least 10 large wagons must be used. If 2000 units of ore need to taken to the surface, minimize the total number of wagons needed.",
        "results": {
            "Number of small wagons": "45.0",
            "Number of large wagons": "22.0",
            "Minimized Total Number of Wagons": "67.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 168,
        "question": "A theme park transports its visitors around the park either by scooter or rickshaw. A scooter can carry 2 people while a rickshaw can carry 3 people. To avoid excessive pollution, at most 40% of the vehicles used can be rickshaws. If the park needs to transport at least 300 visitors, minimize the total number of scooters used.",
        "results": {
            "Number of scooters used": "75.0",
            "Number of rickshaws used": "50.0",
            "Total number of vehicles used": "125.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 169,
        "question": "A company in the middle east delivers their packages to customers on camels and horses. A camel can carry 50 packages while a horse can carry 60 packages. A camel requires 20 units of food while a horse requires 30 units of food. The company needs to deliver at least 1000 packages and they have 450 units of food available. Since horses are not as suited for the hot climate, the number of horses cannot exceed the number of camels. How many of each animal should be used to minimize the total number of animals?",
        "results": {
            "Number of Camels": "12.0",
            "Number of Horses": "7.0",
            "Minimum Total Number of Animals": "19.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 170,
        "question": "A snack exporter sends snacks to his customer in small and large suitcases. A small suitcase can hold 50 snacks while a large suitcase can hold 80 snacks. Most customer prefer small suitcases, and so at least twice as many small suitcases must be used as large suitcases. The exporter has available at most 70 small suitcases and 50 large suitcases. If he must send at least 15 large suitcases and can send  at most 70 suitcases in total, how many of each should he send to maximize the total number of snacks that can be delivered?",
        "results": {
            "Number of small suitcases": "47.0",
            "Number of large suitcases": "23.0",
            "Maximized Total Number of Snacks": "4190.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 171,
        "question": "A mail delivery service in an island village delivers mail by regular and speed boats. A regular boat can carry 20 pieces of mail per trip and uses 10 liters of gas. A speed boat can carry 30 pieces of mail per trip and uses 20 liters of gas. There can be at most 20 regular boat trips. Since customers want their mail as fast as possible, at least 50% of the trips must be made by speed boats. If the service needs to deliver 1000 pieces of mail, how many trips of each should be made to minimize the total amount of gas consumed?",
        "results": {
            "Number of regular boat trips": "20.0",
            "Number of speed boat trips": "20.0",
            "Minimum total amount of gas consumed": "600.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 172,
        "question": "A chicken farmer has sold his chicken and they need to be transported either by bus or by car. A bus can take 100 chicken and takes 2 hours per trip. A car can take 40 chicken and takes 1.5 hours per trip. There can be at most 10 bus trips and at least 60% of the trips must be by car. If the farmer needs to transport 1200 chicken, how many trips of each should be done to minimize the total time needed to transport the chicken?",
        "results": {
            "Number of bus trips": "7.0",
            "Number of car trips": "13.0",
            "Minimized Total Time": "33.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 173,
        "question": "Children can go to school either by van or by minibus. A van can take 6 kids and produces 7 units of pollution. A minibus can take 10 kids and produced 10 units of pollution. There are at least 150 kids than need to go to school and at most 10 minibuses can be used. In addition, the number of vans used must exceed the number of minibuses. How many of each should be used to minimize the total amount of pollution produced?",
        "results": {
            "Number of vans used": "10.0",
            "Number of minibuses used": "9.0",
            "Minimum Total Pollution": "160.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 174,
        "question": "A recycling company collects recycling from neighborhoods using small and large bins. A small bin requires 2 workers while a large bin requires 5 workers. A small bin can hold 25 units of recycling material and a large bin can hold 60 units of recycling material. The company has available 100 workers. Because most people don't recycle, the number of small bins must be at least three times the number of large bins. In addition, there must be at least 10 small bins and 4 large bins. How many of each bin type should be used to maximize the total amount of recycling material that can be collected?",
        "results": {
            "Number of small bins": "40.0",
            "Number of large bins": "4.0",
            "Maximized Total Amount of Recycling Material": "1240.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 175,
        "question": "A toy store hires seasonal and full-time volunteers to deliver gifts and gives them points for service. A seasonal volunteer can deliver 5 gifts and gets 2 points. A full-time volunteer can deliver 8 gifts and gets 5 points. The store can only give out 200 points. In addition, a maximum of 30% of the volunteers can be seasonal and at least 10 must be full-time. How many of each volunteer is needed to maximize the total number of gifts that can be delivered?",
        "results": {
            "Number of Seasonal Volunteers": "14.0",
            "Number of Full-Time Volunteers": "34.0",
            "Maximized Total Number of Gifts Delivered": "342.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 176,
        "question": "A jam company sends its product out in small and large jars. A small jar can hold 50 ml of jam while a large jar can hold 200 ml of jam. Most store prefer the smaller size and so the number of large jars cannot exceed the number of small jars. If the company wants to ship at least 100000 ml of jam, find the minimum number of jars that can be used.",
        "results": {
            "Number of small jars": "400.0",
            "Number of large jars": "400.0",
            "Minimum number of jars": "800.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 177,
        "question": "A corn farmer sends his corn to the city by either tractor or car.  A tractor can carry 40 kg of corn while a car can carry 20 kg of corn. Since tractors are very slow, the number of cars used has to be at least twice the number of tractors used. If at least 500 kg of corn need to be sent to the city, minimize the total number of tractors and cars needed.",
        "results": {
            "Number of Tractors": "6.0",
            "Number of Cars": "13.0",
            "Minimum Total Number of Vehicles": "19.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 178,
        "question": "A village hosts a banquet and provides bike and car transportation for everyone. A bike can take 3 people while a car can take 5 people. Since cars are more expensive, at most 40% of the vehicles can be cars. If the village needs to transport at least 500 people, how many of each vehicle should be used to minimize the total number of bikes needed?",
        "results": {
            "Number of bikes needed": "80.0",
            "Number of cars needed": "53.0",
            "Minimized Total Number of Bikes": "80.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 179,
        "question": "An industrial tire company delivers large tires for equipment to remote engineering sites either by cargo planes or ultrawide trucks. Each cargo plane can transport 10 tires per trip and costs $1000. Each ultrawide truck can transport 6 tires per trip and costs $700. The company needs to transport at least 200 tires and has available $22000. Because most remote sites don't have proper airports, the number of plane trips cannot exceed the number of ultrawide truck trips. How many trips of each should be done to minimize the total number of trips?",
        "results": {
            "Number of cargo plane trips": "11.0",
            "Number of ultrawide truck trips": "15.0",
            "Minimized Total Number of Trips": "26.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 180,
        "question": "A water salesman collects water from a glacier and transports it in either small or large kegs. A small keg can hold 40 liters of water while a large keg can hold 100 liters of water. The salesman has available at most 30 small kegs and 10 large kegs. Since small kegs are easier to carry, at least twice as may small kegs must be used than large kegs. If he can transport at most 25 kegs total and at least 5 kegs must be large, how many of each should he use to maximize the total amount of glacial water he can transport?",
        "results": {
            "Number of small kegs": "17.0",
            "Number of large kegs": "8.0",
            "Maximized total amount of glacial water transported": "1480.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 181,
        "question": "A tropical city full of islands sends mail either by submarine or by boat. A submarine can carry 100 pieces of mail per trip and uses 30 liters of gas. A boat can carry 80 pieces of mail per trip and uses 25 liters of gas. There can be at most 6 submarine trips and a minimum of 50% of the trips must be by boat. If the city needs to transport at least 1000 pieces of mail, how many of each transportation should they use to minimize the total amount of gas used?",
        "results": {
            "Number of submarine trips": "2.0",
            "Number of boat trips": "10.0",
            "Minimum total amount of gas used": "310.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 182,
        "question": "The weather is freezing and the fish in the pond need to be transported either by helicopter or car. A helicopter can take 30 fish per trip and takes 40 minutes. A car can take 20 fish per trip and takes 30 minutes. Since helicopter trips are expensive, there can be at most 5 helicopter trips. In addition, at least 60% of the trips should be by car. If at least 300 fish need to transported, how many of each trip should be taken to minimize the total time needed?",
        "results": {
            "Number of helicopter trips": "4.0",
            "Number of car trips": "9.0",
            "Minimized Total Time (minutes)": "430.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 183,
        "question": "A tourist spot in the mountains allows visitors to travel to the top either by hot-air balloon or gondola lift. A hot air balloon can carry 4 visitors while a gondola lift can carry 6 visitors. Each hot air balloon produces 10 units of pollution while each gondola lift produces 15 units of pollution. There can be at most 10 hot-air balloon rides and at least 70 visitors need to be transported. How many of each type of transport method should be taken to minimize the total pollution produced?",
        "results": {
            "Number of hot-air balloon rides": "10.0",
            "Number of gondola lifts": "5.0",
            "Minimized Total Pollution": "175.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 184,
        "question": "A factory transports rice to the city in horse-drawn carts that are either medium or large size. A medium sized cart requires 2 horses and can carry 30 kg of rice. A large sized cart requires 4 horses and can carry 70 kg of rice.  The factory has 60 horses available. Because the horses don't get along well, the number of medium sized carts must be three times the number of large sized carts. In addition, there must be at least 5 medium sized carts and at least 5 large sized carts. How many of each cart size should be used to maximize the amount of rice that can be transported?",
        "results": {
            "Number of medium sized carts": "18.0",
            "Number of large sized carts": "6.0",
            "Maximized amount of rice transported": "960.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 185,
        "question": "A dog school trains labradors and golden retrievers to deliver newspaper. A labrador can deliver 7 newspapers at a time and requires 5 small bone treats for service. A golden retriever can deliver 10 newspapers at a time and requires 6 small bone treats per service. The school only has 1500 small bone treats available. In addition, at least 50 golden retrievers must be used and at most 60% of the dogs can be labradors. How many of each dog should be used to maximize the number of newspapers that can be delivered?",
        "results": {
            "Number of Labradors": "0.0",
            "Number of Golden Retrievers": "250.0",
            "Maximized Number of Newspapers Delivered": "2500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 186,
        "question": "A construction company in the tropics uses cows and elephants to carry bricks. A cow can carry 20 bricks on its back while an elephant can carry 50 bricks on its back. To avoid having elephants create too much traffic, the number of elephant cannot exceed the number of cows. In addition, there can be at most twice the number of cows as elephants. If the company needs to transport at least 1000 bricks, find the minimum number of animals (cows and elephants in total) that can be used..",
        "results": {
            "Number of cows": "15.0",
            "Number of elephants": "14.0",
            "Minimum total number of animals": "29.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 187,
        "question": "A farmer on an island sends corn to the main land either by ferry or light rail. Each ferry trip can take 20 boxes of corn while each light rail trip can take 15 boxes of corn. Since ferry trips are slow, the number of light rail trip has to be at least 4 times the number of ferry trips. If the farmer wants to send at least 500 boxes of corn, minimize the total number of trips of either type needed.",
        "results": {
            "Number of ferry trips": "6.0",
            "Number of light rail trips": "26.0",
            "Minimum total number of trips needed": "32.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 188,
        "question": "A factory provides rides for its employees in either taxis or company cars. Each taxi ride can take 2 employees while each company car ride can take 3 employees. Since buying and maintaining cars is expensive, at most 60% of the rides can be company car rides. However, there has to be at least 30 company car rides. If the company needs to transport at least 500 employees, how many rides of each should be done to minimize the total number of taxi rides.",
        "results": {
            "Number of taxi rides": "78.0",
            "Number of company car rides": "116.0",
            "Minimized Total Number of Taxi Rides": "78.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 189,
        "question": "A chemical company is transporting their hydrogen using two different methods, high pressure tube trailers and liquefied hydrogen tankers. The first method is a high-pressure tube trailer which can transport 50 cubic meters each per trip at a cost of $500. The second method is using liquefied hydrogen tankers which can transport 30 cubic meters each per trip at a cost of $200. The company needs to transport at least 1000 cubic meters of hydrogen and they have budget of $37500 available. In addition, the number of transports done by the high pressure tube trailer method has to be less than the number of transports done by the liquefied hydrogen tanker method. How many of each transportation method should they use to minimize the total number of trips?",
        "results": {
            "Number of high pressure tube trailer transports": "12.0",
            "Number of liquefied hydrogen tanker transports": "14.0",
            "Minimum Total Number of Trips": "26.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 190,
        "question": "A grape farmer transports his grapes in either small crates or large crates. A small crate can take 200 grapes while a large crate can take 500.  Because his customers prefer smaller crates, at least 3 times as many small crates must be used than large crates. The farmer has available at most 100 small crates and at most 50 large crates. In addition, his truck can take at most 60 crates total and he must use at least 10 large crates. How many of each crate should he use to maximize the total number of grapes he can transport?",
        "results": {
            "Number of small crates": "45.0",
            "Number of large crates": "15.0",
            "Maximized total number of grapes": "16500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 191,
        "question": "A shipping company need to transport packages by either truck or car. A truck can transport 50 packages per trip while a car can transport 30 packages per trip. In addition, a truck uses 20 liters of gas per trip while a car uses 15 liters of gas per trip. There can be at most 5 truck trips made and at least 30% of all the trips must be made by car. The company needs to transport at least 500 packages. How many of each transportation should they use to minimize the total amount of gas consumed?",
        "results": {
            "Number of truck trips": "4.0",
            "Number of car trips": "10.0",
            "Minimum total amount of gas consumed": "230.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 192,
        "question": "There has been a horrible accident and patients need to be taken to the hospital by either a helicopter or bus. A helicopter can transport 5 patients per trip and takes 1 hour. On the other hand, a bus can transport 8 patients per trip and takes 3 hours. At least 120 patients need to be transported and at least 30% of the trips should be by helicopter. In addition, there can be at most 10 bus trips. How should the patients be taken to minimize the total time to transport the patients?",
        "results": {
            "Number of helicopter trips": "24.0",
            "Number of bus trips": "0.0",
            "Minimized Total Time to Transport Patients": "24.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 193,
        "question": "Employees have the option of car-pooling to work or taking the company bus. A car can take 4 employees and produces 10 units of pollution, while a bus can take 20 employees and produces 30 units of pollution. At least 300 employees need to be transported and at most 4 buses can be used. How many of each type of transport should be taken to minimize the total pollution produced.",
        "results": {
            "Number of Cars": "55.0",
            "Number of Buses": "4.0",
            "Minimized Total Pollution": "670.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 194,
        "question": "A snow removal company removes snow from neighborhoods using small trucks and large trucks. A small truck requires 2 people to shovel the snow and can carry 30 units of snow. A large truck require 4 people to shovel the snow and car carry 50 units of snow. The company has available 40 people. In addition, because some neighbourhood don’t allow big trucks, at least 10 trucks must be small. There must be at least 3 large trucks as well and the number of small trucks must be at least twice as much as the number of large trucks. How many of each truck should be used to maximize the total amount of snow that can be transported?",
        "results": {
            "Number of Small Trucks": "14.0",
            "Number of Large Trucks": "3.0",
            "Maximized Total Amount of Snow Transported": "570.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 195,
        "question": "A magic school sends letters to student either by carrier pigeons or owls. A carrier pigeon can carry two letters at a time and requires 3 treats for service. An owl can carry 5 letters at a time and requires 5 treats for service.  At most 40% of the birds can be owls. In addition, the school only has 1000 treats available and at least 20 carrier pigeons must be uses. How many of each bird can be used to maximize the total number of letters that can be sent.",
        "results": {
            "Number of carrier pigeons": "158.0",
            "Number of owls": "105.0",
            "Maximized Total Number of Letters": "841.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 196,
        "question": "An international shipping company uses large and small ships to transport containers around the world. A large ship can carry 500 containers while a small ship can carry 200 containers. Because most ports are small, the number of large ships cannot exceed the number of small ships. If the company is under contract needs to transport at least 3000 containers, find the minimum number of ships that can be used.",
        "results": {
            "Number of Large Ships": "4.0",
            "Number of Small Ships": "5.0",
            "Minimum Number of Ships": "9.000000000000002"
        },
        "type": "linear-notable"
    },
    {
        "index": 197,
        "question": "A large fishing boat sends fish back to shore either by small canoes or smaller diesel boats. A canoe can carry back 10 fish while a small diesel boat can carry back 15 fish. In order to follow environmental rules, the number of small canoes used has to be at least 3 times as many as the number of diesel boats uses. If  at least 1000 fish need to be transported to shore, minimize the total number of canoes and diesel boats needed.",
        "results": {
            "Number of canoes": "67.0",
            "Number of diesel boats": "22.0",
            "Minimum total number of canoes and diesel boats needed": "89.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 198,
        "question": "A volunteer organization transports voters to the polls on Election Day either by vans or cars. They have vans which can carry 6 people and cars which can carry 3 people.  They need to transport at least 200 voters to the polls. In addition, at most 30% of the vehicles can be vans. How many of each vehicle should be used to minimize the total number of cars used?",
        "results": {
            "Number of vans": "15.0",
            "Number of cars": "37.0",
            "Minimized Total Number of Cars Used": "37.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 199,
        "question": "A car manufacturing company makes hamburgers and chicken wraps for workers. They need to ensure workers get at least 2200 calories, 50 grams of protein, and 70 grams of carbs. One hamburger costs $6.5 and contains 800 calories, 19 grams of protein, and 20 grams of carbs. One chicken wrap costs $4 and contains 450 calories, 12 grams of protein, and 10 grams of carbs. What is the minimum cost diet that the company can provide for its workers?",
        "results": {
            "Number of hamburgers": "3.0",
            "Number of chicken wraps": "1.0",
            "Minimum Cost": "23.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 200,
        "question": "A meat processing plant uses two machines, a meat slicer and a meat packer, to make their hams and pork ribs. To produce one batch of hams requires 4 hours on the meat slicer and 2.5 hours on the meat packer. To produce one batch of pork ribs requires 2 hours on the meat slicer and 3.5 hours on the meat packer. Each machine runs for at most 4000 hours per year. If the profit per batch of hams is $150 and the profit per batch of pork ribs is $300, how many batches of each should be made to maximize profit?",
        "results": {
            "Number of batches of hams": "1.0",
            "Number of batches of pork ribs": "1142.0",
            "Maximized Profit": "342750.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 201,
        "question": "An appliance company sells and installs refrigerators and stoves. Each refrigerator takes 60 minutes of mover time and 20 minutes of setup time. Each stove takes 45 minutes of mover time and 25 minutes of setup time. The company has available 20000 minutes of mover time and 13000 minutes of setup time. If the profit per refrigerator is $400 and the profit per stove is $260, how many of each should they sell in order to maximize profit?",
        "results": {
            "Number of Refrigerators": "333.0",
            "Number of Stoves": "0.0",
            "Maximized Profit": "133200.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 202,
        "question": "An office company makes desks and drawers. Each desk requires 40 minutes of assembly and 20 minutes of sanding. Each drawer requires 30 minutes of assembly and 10 minutes of sanding. The company has available 4000 minutes for assembly and 3500 minutes for sanding. If the profit per desk is $100 and the profit per drawer is $90, how many of each should the company make to maximize profit?",
        "results": {
            "Number of Desks": "1.0",
            "Number of Drawers": "132.0",
            "Maximized Profit": "11980.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 203,
        "question": "A milk tea shop owner would like to sell two different milk teas: black milk tea and matcha milk tea. Each contains both milk and honey. A bottle of black milk tea contains 600 grams of milk and 10 grams of honey, whereas a bottle of matcha milk tea contains 525 grams of milk and 5 grams of honey. The profit from each bottle of black milk tea sold is $7.5 and the profit from each bottle of matcha milk tea sold is $5. If his total production must not exceed his available stock of 30000 grams of milk and 500 grams of honey, how many bottles of each type of milk tea should be made to maximize profits?",
        "results": {
            "Number of bottles of black milk tea": "50.0",
            "Number of bottles of matcha milk tea": "0.0",
            "Maximized Profit": "375.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 204,
        "question": "A young boy is trying to grow taller by drinking milk and eating vegetables. He wants to get a minimum of 100 units of calcium and 50 units of iron per day. A glass of milk costs $1 and contains 40 units of calcium and 25 units of iron. A plate of vegetables costs $2 and contains 15 units of calcium and 30 units of iron. How many of each should he consume to minimize his cost?",
        "results": {
            "Number of glasses of milk": "3.0",
            "Number of plates of vegetables": "0.0",
            "Minimized Cost": "3.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 205,
        "question": "Bob wants to design a diet consisting of protein bars and noodles. Assume that each serving of noodles costs $5 and contains 600 calories and 1.5 grams of protein. Assume that each serving of protein bar costs $2.5 and contains 250 calories and 5 grams of protein. He's interested in spending as little money as possible but he wants to ensure that his meals have at least 2000 calories and at least 16 grams of protein per day. Formulate a linear programming problem that will help minimize the cost of the diet.",
        "results": {
            "Number of servings of noodles": "0.0",
            "Number of servings of protein bars": "8.0",
            "Minimum Cost of the Diet": "20.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 206,
        "question": "A toy store sells plush toys and dolls. Each plush toy costs the store $3 and each doll costs the store $2. The store owner can spend at most $700 on inventory. Each plush toy is then sold for a profit of $4 while each doll is sold for a profit of $2. The owner estimates that at least 90 plush toys but at most 190 plush toys are sold each month. He also estimates that the number of dolls sold is at most twice the amount of plush toys sold. How many of each should be bought and sold to maximize profit?",
        "results": {
            "Number of Plush Toys": "190.0",
            "Number of Dolls": "65.0",
            "Maximized Profit": "890.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 207,
        "question": "Forest Paper makes two types of products: graph paper and music paper. Each type of paper requires the use of two machines, a printing machine and a scanning machine. It takes 3 minutes on the printing machine and 5.5 minutes on the scanning machine to make a ream of graph paper. On the other hand, it takes 1.5 minutes on the printing machine and 3 minutes on the scanning machine to make a ream of music paper. Each machine is available for a maximum of 350 minutes per day. The company sells a package of graph paper at a profit of $4 and a package of music paper at a profit of $2.5. The company can sell all the paper it makes. How many reams of each type should the company produce in a day in order to maximize profit? What is that profit?",
        "results": {
            "Number of reams of graph paper": "2.0",
            "Number of reams of music paper": "113.0",
            "Maximized Daily Profit": "290.5"
        },
        "type": "linear-notable"
    },
    {
        "index": 208,
        "question": "Calcium and Magnesium are found in two health supplements, health supplement A and health supplement B. One serving of health supplement A contains 30 grams of Calcium and 50 grams of Magnesium. One serving of health supplement B contains 60 grams of Calcium and 10 grams of Magnesium. The cost per health supplement for health supplement A is $14 and the cost per health supplement for health supplement B is $25. A patient must consume these two health supplements every day to get at least 400 grams of Calcium and 50 grams of Magnesium. Determine how much servings of each supplement the patient needs to minimize her daily cost.",
        "results": {
            "Servings of health supplement A": "0.0",
            "Servings of health supplement B": "7.0",
            "Minimized Daily Cost": "175.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 209,
        "question": "Lucy has a dog and she wants his food to be mixed.  In order to keep the dog healthy but also keep the food tasty, the mix needs to have a minimum of 15 units of calcium, 20 units of vitamin mix, and 20 units of protein. A regular brand costs $20 per bag and contains 4 units of calcium, 7 units of vitamin mix, and 10 units of protein. A premium brand costs $35 per bag and contains 12 units of calcium, 10 units of vitamin mix, and 16 units of protein. How many bags of each brand should Lucy mix in order to minimize cost while also meeting the taste and health requirements.",
        "results": {
            "Number of Regular brand bags": "0.0",
            "Number of Premium brand bags": "2.0",
            "Minimized Cost": "70.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 210,
        "question": "Maple Oil processes three types of crude oil: light oil, non-sticky oil and heavy oil. Each tank of light oil produces a net revenue of $550, each tank of non-sticky oil produces a net revenue of $750, and each tank of heavy oil produces a net revenue of $950. To process a tank of light oil, 3 units of compound A and 3 units of compound B are required. To process a tank of non-sticky oil, 6 units of compound A and 2 units of compound B are required. To process a tank of heavy oil, 9 units of compound A and 3 units of compound B are required. Currently the company has 250 units of compound A and 150 units of compound B to process. How many full or partial tanks of each oil should the company process so that net revenue is maximized?",
        "results": {
            "Number of tanks of Light Oil": "33.0",
            "Number of tanks of Non-Sticky Oil": "25.0",
            "Number of tanks of Heavy Oil": "0.0",
            "Maximized Net Revenue": "36900.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 211,
        "question": "A flooring company produces engineered laminate planks and carpets. The chief marketer reports an expected demand of at least 15,000 square feet of laminate planks and 5,000 square feet of carpets each week. The shipping contract requires a total of at least 50,000 square feet of products each week. However, due to a shortage of raw materials, no more than 40,000 square feet of laminate planks and 20,000 square feet of carpets can be produced weekly. The output of the products (laminate planks and carpets) is an integer in square feet. If a square foot of laminate planks produces a $2.1 profit and a square foot of carpets yields a $3.3 profit, how many of each type of product should be made weekly to maximize the company's profit?",
        "results": {
            "Square feet of laminate planks to produce weekly": "40000.0",
            "Square feet of carpets to produce weekly": "20000.0",
            "Maximized Weekly Profit": "150000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 212,
        "question": "A man takes two supplements to get his daily iron and calcium requirements. A pill of supplement A has 5 units of iron and 10 units of calcium. A pill of supplement B contains 4 units of iron and 15 units of calcium.  The man needs a minimum of 40 units of iron and 50 units of calcium per day. If the cost per pill of supplement A is $2 and the cost per pill of supplement B is  $3, how many of each should he buy to minimize costs?",
        "results": {
            "Number of pills of supplement A": "8.0",
            "Number of pills of supplement B": "0.0",
            "Minimized Cost": "16.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 213,
        "question": "A fashion company sells regular handbags and premium handbags made of higher quality material. They can sell regular handbags at a profit of $30 each and premium handbags at a profit of $180 each. The total monthly cost of manufacturing is $200 per regular handbag and $447 per premium handbag. The company has a total budget of $250000 and can sell at most 475 handbags of either type per month. How many of each handbag should they sell to maximize its monthly profit?",
        "results": {
            "Number of regular handbags": "0.0",
            "Number of premium handbags": "475.0",
            "Maximized Monthly Profit": "85500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 214,
        "question": "A woman has $100000 to gamble on two sports bets: a basketball tournament, a horse race, and a soccer game. Based on simple analysis, the woman determines her chance of losing her money would be 50% for basketball tournament, 25% for horse race, and 10% for the soccer game. The payout for each dollar put on each bet will be $1.2 for basketball tournament, $0.5 for horse race, and $0.1 for the soccer game. Knowing herself,  she limits her average loss of money to no more than 30% of the total amount. Could you help her determine how much to money to put on each sport bet to maximize her average payout?",
        "results": {
            "Money on Basketball Tournament": "60000.0",
            "Money on Horse Race": "0.0",
            "Money on Soccer Game": "0.0",
            "Maximized Average Payout": "72000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 215,
        "question": "A repairman fixes washing machines and freezers. Each washing machine takes 30 minutes of inspection and 90 minutes of fixing time. Each freezer takes 20 minutes of inspection and 125 minutes of fixing time. The repairman has 5000 minutes available for inspection and 20000 minutes available in his schedule. If each washing machine repaired earns him $250 and each freezer repaired earns his $375, how many of each appliance should he fix to maximize his earnings?",
        "results": {
            "Number of washing machines": "0.0",
            "Number of freezers": "160.0",
            "Maximized Earnings": "60000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 216,
        "question": "A small bakery has 20000 grams of batter and 14000 grams of milk to make their crepe cakes, sponge cakes, and birthday cakes. A crepe cake needs 400 grams of batter and 200 grams of milk. A sponge cake requires 500 grams of batter and 300 grams of milk. A birthday cake requires 450 grams of batter and 350 grams of milk. If the profit per crepe cake is $12, the profit per sponge cake is $10, and the profit per birthday cake is $15, how many of each should the bakery make to maximize their profit?",
        "results": {
            "Number of Crepe cakes": "14.0",
            "Number of Sponge cakes": "-0.0",
            "Number of Birthday cakes": "32.0",
            "Maximized Profit": "648.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 217,
        "question": "Super Shop sells cat paw snacks and gold shark snacks in bulk. It plans to sell them into two snack mix products. The first mix contains 20% cat paw snacks and 80% gold shark snacks. The second mix contains 35% cat paw snacks and 65% gold shark snacks. The store has on hand 20 kg of cat paw snacks and 50 kg of gold shark snacks. If the profit per kg of the first mix is $12 and the profit per kg of the second mix is $15, how many kg of each should be prepared to maximize profit?",
        "results": {
            "Kg of first mix prepared": "29.999999999999996",
            "Kg of second mix prepared": "40.0",
            "Maximized Profit": "960.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 218,
        "question": "A taco stand sells regular tacos and deluxe tacos with extra meat. The stand makes x1 regular tacos at a profit of $2.50 each and x2 deluxe tacos at a profit of $3.55 each (x1 and x2 are unknown variables both greater than or equal to 0). There is a demand for at most 50 regular tacos and at most 40 deluxe tacos. The stand only has enough supplies to sell at most 70 tacos of either type. How many of each taco should the stand make to maximize profit?",
        "results": {
            "Number of regular tacos": "30.0",
            "Number of deluxe tacos": "40.0",
            "Maximized Profit": "217.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 219,
        "question": "A printing company sells math workbooks and English workbooks. To meet demand, they must make at least 40 math workbooks and at least 60 English workbooks. However, they can make at most 140 math workbooks and at most 170 English workbooks. The company has a contract with a school to send at least 200 workbooks of either type. If the profit per math workbook is $15 and the profit per English workbook is $17, how many of each should the company make to maximize profit?",
        "results": {
            "Number of Math Workbooks": "140.0",
            "Number of English Workbooks": "170.0",
            "Maximized Profit": "4990.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 220,
        "question": "A music company produces two types of digital keyboards, one is full-weighted and another is semi-weighted. Both keyboards are sold for $2800 and $2400 respectively. There are about 3500 oscillator chips available every day from which the full-weighted version requires 20 chips while the semi-weighted version requires 15 chips. The company has a total of 6 working hours a day. Both of these keyboards require a production time of 1.2 hours. What should be the manufacturing quantity for each of the keyboards to maximize the total revenue?",
        "results": {
            "Number of full-weighted keyboards": "1.0",
            "Number of semi-weighted keyboards": "232.0",
            "Maximized Total Revenue": "559600.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 221,
        "question": "Platinum Database sells two types of subscription software packages: a personal license and a commercial license which will cost $550 and $2000 to generate respectively. The marketing department estimates that they can sell at most 300 licenses for both versions combined a month. The profit per personal license is $450 and the profit per commercial version is $1200. If the company does not want to spend more than $400000, how many of each software package should they produce to maximize the profits.",
        "results": {
            "Number of personal licenses": "138.0",
            "Number of commercial licenses": "162.0",
            "Maximized Profits": "256500.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 222,
        "question": "Zeta Bakery sells two types of cookies. They sell a strawberry cookie and a sugar cookie. Let's say they make x1 strawberry cookies, at a profit of $5.5 each, and x2 sugar cookies, at a profit of $12 each (x1 and x2 are unknowns both greater than or equal to 0). The daily demand for these cookies is at most 100 strawberry cookies and at most 80 sugar cookies. The bakery is short staffed and can make a maximum of 100 cookies of either type per day. How much of each cookie should the bakery make in order to maximize profit?",
        "results": {
            "Number of strawberry cookies": "20.0",
            "Number of sugar cookies": "80.0",
            "Maximized Daily Profit": "1070.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 223,
        "question": "A food company would like to run its commercials on three streaming platforms: Pi TV, Beta Video and Gamma Live. The cost for a commercial as well as the expected audience reach is given. On Pi TV, a commercial costs $1200 and attracts 2000 viewers. On Beta Video, a commercial costs $2000 and attracts 5000 viewers. On Gamma Live, a commercial costs $4000 and attracts 9000 viewers. Beta Video limits the number of commercials from a single company to 8. In order to attract a wide range of people, at most a third of all commercials should occur on Gamma Live and a minimum of 20% should occur on Pi TV. If the weekly budget is $20000, how many commercials should be run in each of the three possible choices in order to maximize audience?",
        "results": {
            "Number of commercials on Pi TV": "3.0",
            "Number of commercials on Beta Video": "8.0",
            "Number of commercials on Gamma Live": "0.0",
            "Maximized Audience": "45999.99999999999"
        },
        "type": "linear-notable"
    },
    {
        "index": 224,
        "question": "A disease testing station is conducting a temperature check and/or a blood test on each patient. A temperature check takes 2 minutes while a blood test takes 10 minutes. The disease testing station must conduct at least 45 blood tests. Since the temperature check is recommended to be performed on most people, the testing station requires that the temperature check is performed at least 5 times as many as the blood test. If the disease testing station only has a total of 22000 staff minutes, how many of each test or check should be done to maximize the number of patients seen?",
        "results": {
            "Number of Temperature Checks": "10775.0",
            "Number of Blood Tests": "45.0",
            "Maximized Number of Patients Seen": "10820.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 225,
        "question": "The government is reworking the pipes to transport water to houses in the area. The water can be transported through wide pipes or narrow pipes. Wide pipes can transport 25 units of water per minute and narrow pipes can transport 15 units of water per minute. Due to logistics, the number of wide pipes can be at most a third the number of narrow pipes. If there needs to be at least 900 units of water transported every minute, and at least 5 wide pipes must be used, minimize the total number of pipes required.",
        "results": {
            "Number of wide pipes": "13.0",
            "Number of narrow pipes": "39.0",
            "Total number of pipes": "52.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 226,
        "question": "A concert organizer has to transport equipment using carts or trolleys. Carts can transport 5 kg/min of equipment and requires 2 workers. Trolleys can transport 7 kg/min of equipment and requires 4 workers. There must be at least 12 trolleys to be used. Additionally, only a maximum of 40% of the transportation equipments can be using trolleys. The organizer has to deliver at a rate of 100 kg/min of equipment. How many of each transportation method should be used to minimize the total number of workers?",
        "results": {
            "Number of Carts": "18.0",
            "Number of Trolleys": "12.0",
            "Minimum Total Number of Workers": "84.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 227,
        "question": "Both subsoil and topsoil need to be added to a garden bed. One bag of subsoil requires 10 units of water to hydrate while one bag of topsoil requires 6 units of water to hydrate every day. The truck used to transport the dirt has limited capacity and therefore, the farmer has available 150 bags of topsoil and subsoil combined. In addition, at least 10 bags of topsoil must be used. Since the topsoil is more expensive, at most 30% of all bags of soil can be topsoil. How many bags of each should be bought to minimize the total amount of water required to hydrate the garden bed?",
        "results": {
            "Number of bags of subsoil": "24.0",
            "Number of bags of topsoil": "10.0",
            "Minimum total amount of water required": "300.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 228,
        "question": "An extremely large ski resort is looking into purchasing two types of ski lifts, a densely-seated one and a loosely-seated one. The densely-seated ski lift is able to bring 45 guests up the slopes every minute whereas the loosely-seated ski lift can transport 20 guests every minute.  The densely-seated ski lift uses 30 units of electricity and the loosely-seated lift uses 22 units of electricity. There must be at least five loosely-seated ski lifts because they move slower and are friendlier for beginners. The ski resort needs at least 1000 guests every minute to make a profit and has available 940 units of electricity. How many of each type of ski lifts should they plan to install to minimize the total number of ski lifts needed?",
        "results": {
            "Number of densely-seated ski lifts": "20.0",
            "Number of loosely-seated ski lifts": "5.0",
            "Minimum Total Number of Ski Lifts Needed": "25.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 229,
        "question": "A strata-management company is looking into purchasing two types of air conditioners, a low-power and a high-power model. A low-powered air conditioner can cool down 12 housing units and uses 150 units of electricity every day. A high-power model can cool down 17 housing units and uses 250 units of electricity every day. Since the low-powered model is not good for the aesthetics, the strata decided to limit the number of low-powered models to only 30% and at least 7 high-powered models must be used. If the apartment needs to condition at least 250 housing units and has 3600 units of electricity available, how many of each air conditioner should the strata company buy to minimize the total number of air conditioners?",
        "results": {
            "Number of Low-Powered Air Conditioners": "4.0",
            "Number of High-Powered Air Conditioners": "12.0",
            "Total Number of Air Conditioners": "16.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 230,
        "question": "A student takes calcium pills and vitamin D pills one after the other. Each calcium pill takes 5 minutes to be effective while each vitamin D pill takes 6 minutes to be effective. Over a month, the student must take at least 130 pills of medication and at least 40 should be vitamin D pills because they enhance the absorption of calcium in the body. Since vitamin D is complimentary to calcium, the student must take more calcium pills than vitamin D pills. How many pills of each should the student take to minimize the total time it takes for the medication to be effective?",
        "results": {
            "Number of Calcium Pills": "90.0",
            "Number of Vitamin D Pills": "40.0",
            "Minimized Total Effective Time": "690.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 231,
        "question": "An amusement park has two types of games: throwing and climbing games. Throwing games attract 15 customers every hour and climbing games attract 8 customers every hour. Throwing games costs the amusement park $2 in prizes per hour whereas climbing games cost $3 in prizes per hour. Since throwing games yield the most profit, there must be at least twice as many throwing games as climbing games. However, at least 5 games must be climbing. If the amusement park can have at most $100 in prizes every hour, maximize the total number of customers attracted every hour.",
        "results": {
            "Number of Throwing Games": "42.0",
            "Number of Climbing Games": "5.0",
            "Maximized Total Number of Customers Attracted Every Hour": "670.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 232,
        "question": "In a science fair, there are two types of tables that can be used to display the children’s science experiments. At the circular tables, 4 poster boards and 5 participants can fit around the table to cater to 8 guests. At the rectangular tables, 4 poster boards and 4 participants can fit around the table to cater to 12 guests. However, each circular table takes up 15 units of space while each rectangular table takes up 20 units of space. The science fair has must be able to fit at least 500 participants and 300 poster boards. If the science fair has available 1900 units of space, how many of each type of table should be set up to maximize the number of catered guests?",
        "results": {
            "Number of Circular Tables": "60.0",
            "Number of Rectangular Tables": "50.0",
            "Maximized Number of Catered Guests": "1080.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 233,
        "question": "An oil and gas company has two types of pipes, a high-volume and a low-volume one. Every day, the high-volume pipe allows 10000 US gallons and it is recommended that 12 technicians closely monitor the pipes to ensure that it is functioning properly. Each day, the low-volume pipe allows 5000 US gallons and 5 technicians should closely monitor for safety reasons. Every day, the oil and gas company needs to meet the demands of at least 150000 US gallons of gas and they have 160 technicians that are on their staff. Since the high-volume pipe has a higher risk of environmental damage, at most 35 percent of the pipes can be high-volume ones. Additionally, there must be a minimum of 8 low-volume pipes. How many of each pipe types should be used to reduce the total number of pipes required?",
        "results": {
            "Number of high-volume pipes": "5.0",
            "Number of low-volume pipes": "20.0",
            "Total number of pipes required": "25.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 234,
        "question": "A hospital hires ultrasound technicians and graduate researchers to image patients. An ultrasound technician works 8 hours per shift while a graduate researcher works 5 hours per shift. Ultrasound technicians are paid $300 per shift while graduate researchers are paid $100 per shift. However, due to regulations, there must be at least twice as many ultrasound technician shifts than graduate researcher shifts. Currently, the hospital needs 500 hours of ultrasound services to meet needs. If the hospital has a budget of $80000, how many shifts of ultrasound technicians and graduate researchers certified to use the ultrasound should be scheduled to reduce the total number of shifts?",
        "results": {
            "Number of ultrasound technician shifts": "63.0",
            "Number of graduate researcher shifts": "-0.0",
            "Total number of shifts minimized to": "63.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 235,
        "question": "A dentist has 3000 units of resin to fill cavities in both molars and canines. Molars require 20 units of resin and 3 units of pain killer. Canines require 15 units of resin and 2.3 units of pain killer. Since this dentist sees more cavities in canines, at least 60% of cavities filled must be in canines. In addition, the dentist must reserve materials to fill at least 45 molars. How many of each type of teeth should the dentist schedule to fill to minimize the amount of pain killer needed?",
        "results": {
            "Number of molars to fill": "45.0",
            "Number of canines to fill": "68.0",
            "Minimum amount of pain killer needed": "291.40000000000003"
        },
        "type": "linear-notable"
    },
    {
        "index": 236,
        "question": "A food delivery person can either have shifts on bikes or scooters. A shift on a bike can deliver 10 orders, takes 5 units of energy, and brings in $50 on tips because it is faster. A shift on a scooter can deliver 7 orders, takes 6 units of energy, and brings in $43 on tips.  The delivery person has available 40 shifts a month and has 230 units of energy and must bring at least 320 orders. He must have at least 5 shifts on a scooter because bikes are harder to get. How many shifts on each type of transportation should the delivery person schedule to maximize tips received?",
        "results": {
            "Number of shifts on bikes": "35.0",
            "Number of shifts on scooters": "5.0",
            "Maximized Tips Received": "1965.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 237,
        "question": "A singer has two types of concerts he can hold, pop and R&B. Each pop concert will bring in 100 audience members and take 2 days of practice. Every R&B concert brings in 240 audience members and takes 4 days of practice. The singer must bring in at least 10000 audience members and only has available 180 days for practice. If he can at most perform 40% of his concerts as R&B because he likes pop songs more, how many of each type of concert should be created to minimize the total number of concerts?",
        "results": {
            "Number of Pop concerts": "40.0",
            "Number of R&B concerts": "25.0",
            "Minimized Total Number of Concerts": "65.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 238,
        "question": "A neighbourhood pizza restaurant has opened and sells pizzas in two sizes; large pizza and medium pizza. Large pizzas require 12 units of dough, and 5 units of toppings. Medium pizzas require 8 units of dough, and 4 units of toppings. While large pizzas take 12 minutes to bake, medium pizzas require 8 minutes to bake. The neighbourhood pizza restaurant must use at least 10000 units of dough and 4400 units of toppings. Medium pizzas are popular due to a promotion, therefore, at least 200 medium pizzas must be made. There are regulars that prefer large pizzas and at least two times as many large pizzas should be made than medium pizzas. How many of each size of pizzas should the neighbourhood pizza restaurant make to reduce time spent baking?",
        "results": {
            "Number of Large Pizzas": "629.0",
            "Number of Medium Pizzas": "314.0",
            "Minimum Time Spent Baking": "10060.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 239,
        "question": "A party organizer needs to transport party goers either by limousine or bus. Limousines can carry 12 people and buses can carry 18 people. They need to transport at least 400 people. Because limousines are more attractive, at least 70% of the vehicles must be limousines. How many of each type of vehicle should be used to minimize the total number of limousines and buses used?",
        "results": {
            "Number of Limousines": "21.0",
            "Number of Buses": "9.0",
            "Total Number of Vehicles Used": "30.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 240,
        "question": "A hospital purchases two pills available for the patients to take one at a time. One pill is taken as a prevention and another is taken for treatment. The prevention pill takes 15 dollars to make while the treatment pill takes 25 dollars to make. Since the prevention pill is in higher demand, the hospital must purchase at least two times as many prevention pills as treatment pills. In addition, the hospital must purchase at least 50 treatment pills. If the clinic only has a budget of 10000 dollars, maximize the number of patients that can be treated.",
        "results": {
            "Number of prevention pills": "583.0",
            "Number of treatment pills": "50.0",
            "Maximized number of patients treated": "633.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 241,
        "question": "A dim sum restaurant can deliver their food by cart or by hand. Servers can deliver by cart and have 70 customer interactions and will have to refill food five times an hour. They can also deliver more food by hand, due to the increased mobility, and have 85 customer interactions while refilling food twenty times an hour. However, the customers get more options when delivering by cart, therefore at least 70% of delivery shifts must be by cart. There must be at least 3 servers delivering by hand for their direct customer service. If the restaurant wants to have 4000 customer interactions per hour, how many of each form of delivery should the dim sum restaurant schedule to minimize the total number of refills per hour?",
        "results": {
            "Number of servers delivering by cart": "54.0",
            "Number of servers delivering by hand": "3.0",
            "Minimum total number of refills per hour": "330.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 242,
        "question": "A macro-counting fitness guru only eats salmon and eggs. Each bowl of salmon contains 300 calories, 15 grams of protein, and 80 mg of sodium. Each bowl of eggs contains 200 calories, 8 grams of protein, and 20 mg of sodium. Since the fitness guru has a limit to how many eggs he would like to eat, at most 40% of his meals can be eggs. The fitness guru needs to eat at least 2000 calories and 90 grams of protein. How many of each type of meal should he eat to minimize his sodium intake?",
        "results": {
            "Number of Salmon bowls": "5.0",
            "Number of Egg bowls": "3.0",
            "Minimized Sodium Intake": "460.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 243,
        "question": "A restaurant has two combos available to their customers, an original and an experimental meal. The original meal typically generates 20 units of food waste and 45 units of wrapping waste and takes 10 minutes to cook. In comparison, the experimental meal generates 25 units of food waste and 35 units of wrapping waste and takes 15 minutes to cook. The restaurant can have at most 900 units of wrapping waste and can have at most 800 units of food waste as regulated by the government. How many of each combo should be pushed for by the waiting staff to minimize the cooking time?",
        "results": {
            "Number of Original Combos": "-0.0",
            "Number of Experimental Combos": "-0.0",
            "Minimized Cooking Time": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 244,
        "question": "A metal-working shop has access to two types of metal-working equipment, a chop saw and a steel cutter. A chop saw can work 25 pounds of steel and generates 25 units of waste every day. A steel cutter can only cut 5 pounds of steel and generates 3 units of waste every day.  The metal-working shop is expecting an increase in demand and must cut 520 pounds of metal every day. However, there is a waste limitation due to the fines that may be in place if too much heavy metal is discarded and they may at most produce 400 units of waste every day. How should the metal-working shop purchase their metal-working equipment to decrease the total number of metal-working equipment needed?",
        "results": {
            "Number of Chop Saws": "8.0",
            "Number of Steel Cutters": "64.0",
            "Minimum Total Number of Metal-Working Equipment Needed": "72.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 245,
        "question": "A cruise company can either have two types of trips, a large cruise ship or a small cruise ship. A large cruise ship trip can carry 2000 customers and produces 20 units of pollution. A small cruise ship trip can carry 800 customers and produces 15 units of pollution. There can be at most 7 large cruise ship trips and at least 40% of the total trips must be made by small cruise ships. If the cruise company aims to transport at least 20000 customers, how many of each size of cruise ships should the company use to minimize the total amount of pollution produced?",
        "results": {
            "Number of large cruise ship trips": "7.0",
            "Number of small cruise ship trips": "8.0",
            "Minimized Total Pollution": "260.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 246,
        "question": "A lighting company has access to two types of lights to provide their customers, an LED fixture, and a fluorescence lamp. The LED light uses 5 units of electricity per hour and needs to be changed 3 times a decade. Conversely, the fluorescence lamp uses 8 units of electricity per hour and needs to be changed 4 times a decade. Due to previous installations, at least 30% implemented lights must be fluorescence lamps. If the customer requires at least 300 light fixtures and can use at most 2000 units of electricity, how many of each light should be installed to reduce the total number of light changes?",
        "results": {
            "Number of LED fixtures": "210.0",
            "Number of fluorescence lamps": "90.0",
            "Total number of light changes minimized to": "990.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 247,
        "question": "A market owner wants to start a jam business. He can either sell one unit of jam to customers in a set of small packets or jugs. A set of small packets can hold 100 ml of jam while a jug can hold 125 ml of jam. Since a set of small packets are more expensive to make, at least three times as many jugs must be used than sets of small packets. On the other hand, at least 35 sets of small packets should be filled. If the market owner has 65000 ml of jam, how many sets of small packets or jugs should be selected to maximize the total number of units that he can sell to his customers?",
        "results": {
            "Number of sets of small packets": "136.0",
            "Number of jugs": "411.0",
            "Maximized Total Units": "547.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 248,
        "question": "A navy ship is stocking food onto their submarine and their staff can eat either a salad or fruit bowl for their fibre and vitamin intake. The nutritionist in charge of this voyage needs to ensure that their staff gets at least 90 units of vitamin and 110 units of fibre each. Each salad contains 7 units of vitamins and 12 units of fibre. Each fruit bowl contains 15 units of vitamin and 3 units of fibre. In addition, since fruit bowls take longer to prepare, at most 30% of their meals should be fruit bowls. Each staff can eat at most 12 meals per day. If each salad contains 2 units of potassium and each fruit bowl contains 8 units of potassium, how many of each should they prepare for each staff to maximize their potassium intake?",
        "results": {
            "Number of Salads": "9.0",
            "Number of Fruit Bowls": "3.0",
            "Maximized Potassium Intake": "42.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 249,
        "question": "A clothing company can sell their product in two types of stores, a retail store and a factory outlet. A retail store brings in 200 customers every day and requires 6 employees to operate. A factory outlet brings in 80 customers every day and due to the lower traffic and being in more remote areas, requires 4 employees to run. Company executives decided that there must be at least 1200 customers every day, and can make available 50 employees. How should the company distribute their product to the two types of store to reduce the number of stores that must be open?",
        "results": {
            "Number of Retail Stores": "6.0",
            "Number of Factory Outlets": "0.0",
            "Minimum Number of Stores Required": "6.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 250,
        "question": "A soda company sells soda in two types of containers: cans and glass bottles. A can holds 250 ml of soda whereas a bottle holds 1000 ml of soda. The soda company needs to bottle at least 1000000 ml of soda every day and due to the ability to sell soda cans as packs, there must be at least three times more cans than glass bottles. However, because of previous contracts with gas stations, there must be at least 100 glass bottles made. How many of each should be made to minimize the total number of containers used?",
        "results": {
            "Number of Cans": "1716.0",
            "Number of Bottles": "571.0",
            "Minimum Total Number of Containers": "2287.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 251,
        "question": "A candle-making company can move their inventory of candles using freight and air. Freight can transport 5 tons per trip while using air can transport 3 tons per trip. Since freight take longer, the cost for each freight trip is $300 while the cost over air for each trip is $550. The company needs to transport at least 200 tons of candles and they have a budget of $20000. Additionally, due to some urgent orders, at least 30% of tons of candles must be transported through air. There must also be at least 5 trips through freight. How many of trip by each should be scheduled to minimize the total number of trips?",
        "results": {
            "Number of trips by Freight": "28.0",
            "Number of trips by Air": "20.0",
            "Total Number of Trips": "48.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 252,
        "question": "A production company needs to transport their equipment and staff for a movie they are shooting using large mobile production units or small mobile production units. Large mobile production units can hold 6 people and takes up 2 parking spots whereas small mobile production units can hold only 2 people and takes up 1 parking spot. Movie stars prefer to have their small mobile production unit to share with a close staff, therefore at least 5 units must be small mobile units. However, due to logistic limitations, large mobile production units are more space efficient per spot, they must make up at least 75% of all vehicles. If the movie needs to transport 80 people, minimize the total number of parking spots required by this production.",
        "results": {
            "Number of large mobile production units": "15.0",
            "Number of small mobile production units": "5.0",
            "Minimum number of parking spots required": "35.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 253,
        "question": "A mask making company ships masks to their retail stores using small boxes and large boxes. A small box holds 25 masks whereas a large box holds 45 masks. Since small boxes are easier to stack and will be used first to stock stores, there must be at least three times as many small boxes as large boxes. Additionally, at least 5 large boxes must be used. If at least 750 masks are required to be distributed, how many of each size of box should be used to minimize the total number of boxes needed?",
        "results": {
            "Number of small boxes": "21.0",
            "Number of large boxes": "5.0",
            "Minimum total number of boxes needed": "26.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 254,
        "question": "Grain is transported from a farm to local grocery stores in either large bags or tiny bags. Large bags can hold 25 kg of grain and requires 4 units of energy to transport. Tiny bags can hold 6 kg of grain and requires 1.5 units of energy to transport. The distribution process has access to 210 units of energy. Because of popularity of buying in bulk, there must be at least twice as many large bags as tiny bags of rice. Additionally, there must be at least 20 tiny bags of rice. How many of each size of rice bags should be used to maximize the total amount of grain in weight?",
        "results": {
            "Number of Large Bags": "45.0",
            "Number of Tiny Bags": "20.0",
            "Maximized Total Amount of Grain in Weight": "1245.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 255,
        "question": "An autobody shop needs to purchase two types of car jacks, an automatic electric one, or a gas-powered one. The automatic electric one can process 5 cars every hour and uses 6 units of electricity whereas the gas-powered one can process 4 cars each hour using 7 units of gas. Since there is a limit to how many automatic electric ones there can be due to the limited number of power outlets, the shop must use less than 15 automatic electric ones. The shop can use at most 50 units of electricity and 80 units of gas. How many of each type of jack should the shop purchase to maximize the amount of cars processed every hour?",
        "results": {
            "Number of automatic electric jacks": "8.0",
            "Number of gas-powered jacks": "11.0",
            "Maximized Cars Processed per Hour": "84.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 256,
        "question": "A railway company is planning the infrastructure for the city and is considering two types of transportation, trains and trams. Each train can transport 120 people per hour comfortably and each tram can transport 30 people per hour comfortably. Since trains take longer to build, the number of trams must be at least twice the number of trains. If the railway company wants to transport at least 600 people per hour, minimize the total number of transportation units required.",
        "results": {
            "Number of Trains": "3.0",
            "Number of Trams": "8.0",
            "Total Number of Transportation Units": "11.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 257,
        "question": "Platinum in combination with palladium has been used as a catalyst in cars and it changes carbon monoxide, which is toxic, into carbon dioxide. An automotive company is comparing two different catalysts, a palladium-heavy catalyst and a platinum-heavy catalyst. The process with a palladium-heavy catalyst requires 15 units of platinum and 25 units of palladium and can perform the conversion to carbon dioxide at a rate of 5 units per second. A platinum-heavy catalyst requires 20 units of platinum and 14 units of palladium and converts to carbon dioxide at a rate of 4 units per second. There are 450 units of platinum and 390 units of palladium available. How many of each catalyst should be used to maximize the amount converted into carbon dioxide?",
        "results": {
            "Number of palladium-heavy catalysts": "6.0",
            "Number of platinum-heavy catalysts": "17.0",
            "Maximized amount converted into CO2": "98.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 258,
        "question": "There are two ways to extract a metal from mined ores. The first way is to use process J and the second is process P. Process J can extract 5 units of metal using 8 units of water and produces 3 units of pollution. Process P can extract 9 units of metal using 6 units of water and produces 5 units of pollution. There can be at most 1500 units of water 1350 units of pollution. How many of each type of processes should be performed to maximize the amount of metal extracted?",
        "results": {
            "Number of Process J": "0.0",
            "Number of Process P": "250.0",
            "Maximized Amount of Metal Extracted": "2250.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 259,
        "question": "An airport can either install escalators or elevators. Escalators can transport 20 people every minute whereas elevators can transport 8 people every minute. Escalators take up 5 units of space while elevators take 2 units of space. The airport needs to have enough capacity to transport at least 400 people every minute. Additionally, there must be at least three times more escalators than elevators and at least 2 elevators must be used. How many of each type should the airport install to minimize the total units of space taken?",
        "results": {
            "Number of escalators": "18.0",
            "Number of elevators": "5.0",
            "Minimized Total Units of Space": "100.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 260,
        "question": "A research group is making fabric and plastic using two methods, method A and method B. Method A produces 25 units of fabric and 14 units of plastic per hour. Method B produces 45 units of fabric and 25 units of plastic per hour. Method A requires 60 units of a special element while method B requires 65 units of the same special element. The research group has available 3500 units of the special element and must make at least 1400 units of fabric and 1000 units of plastic. How many of each method should be executed to minimize the total time needed?",
        "results": {
            "Hours for Method A": "0.0",
            "Hours for Method B": "40.0",
            "Minimized Total Time": "40.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 261,
        "question": "A taxi company will purchase vehicles to rent to their drivers. They are interested in purchasing either motorcycles or sedans. A motorcycle can transport 30 people, produces 4 units of pollution, and earns the taxi company $100 per shift. A sedan can transport 70 people, produces 15 units of pollution and earns the company $225 per shift. Because not every customer is comfortable with a motorcycle, at most 25% of vehicles can be motorcycles. Additionally, the company has committed to producing no more than 400 units of pollution. The company needs to transport at least 1200 people every shift. How many of each type of vehicle should be used to maximize the total earnings for the taxi company per shift?",
        "results": {
            "Number of Motorcycles": "6.0",
            "Number of Sedans": "25.0",
            "Maximized Total Earnings per Shift": "6225.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 262,
        "question": "Due to an accident, at least 550 locals must be moved across a lake. They can either be transported over the lake by a kayak or a motorboat. Kayaks can transport 4 people every trip and motorboats can transport 5 people every trip. Kayaks take 5 minutes per trip whereas motorboats take 3 minutes per trip. Due to the limited number of motorboats available to the locals, there can be at most 25 motorboat trips and at least 75% of the trips should be by kayak. How many of each transportation method should be used to minimize the total amount of time needed to transport all the locals?",
        "results": {
            "Number of Kayak trips": "107.0",
            "Number of Motorboat trips": "25.0",
            "Minimized Total Time": "610.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 263,
        "question": "A drop-in clinic is performing a test either through the ear or blood. A blood test takes 30 minutes to perform while an ear test takes 5 minutes to perform. Since the blood test is more accurate, at least three times as many blood tests should be performed as ear tests. However, at least 12 ear tests must be administered. If the drop-in clinic operates for 7525 minutes, maximize the number of tests that can be performed.",
        "results": {
            "Number of ear tests": "79.0",
            "Number of blood tests": "237.0",
            "Maximized Number of Tests": "316.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 264,
        "question": "A researcher is outsourcing annotations and has two options: a specialized third-party or a common third-party annotation company. The specialized company can annotate at a rate of 60 images per hour whereas the common company can annotate at a rate of 40 images per hour. However, the specialized company charges $100 per hour and the common company charges $72 per hour. The researcher has deadlines to meet and must complete a dataset of at least 10,000 images. They also have some special images that only the specialized company can annotate. Therefore, at least a third of work must be allocated to the specialized company. Hours allocated to the two companies should be an integer in hours. How should the researcher distribute the annotations hours to the two companies to minimize the cost of annotating the whole dataset?",
        "results": {
            "Hours allocated to specialized company": "166.0",
            "Hours allocated to common company": "1.0",
            "Minimum Cost": "16672.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 265,
        "question": "A golf course is hosting an event and can transport guests using either golf carts or pull carts. A golf cart can take 4 guests while a pull cart can take 1 guest. Since golf carts take up a lot of space, at most 60% of carts can be golf carts. If the golf course needs to transport at least 80 guests, how many of each cart should be used to minimize the total number of carts needed?",
        "results": {
            "Number of golf carts": "17.0",
            "Number of pull carts": "12.0",
            "Minimum total number of carts needed": "29.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 266,
        "question": "A smoothie shop has a promotion for their two smoothies; an acai berry smoothie and a banana chocolate smoothie. It takes 7 units of acai berries and 3 units of water to make the acai berry smoothie. It takes 6 units of banana chocolate and 4 units of water to make the banana chocolate smoothie. Banana chocolate smoothies are more popular and thus the number of banana chocolate smoothies made must be more than the number of acai berry smoothies made. However, the acai berry smoothies have a loyal customer base, and at least 35% of the smoothies made must be acai berry smoothies. If the smoothie shop has 3500 units of acai berries and 3200 units of banana chocolate, to reduce the total amount of water, how many of each smoothie type should be made?",
        "results": {
            "Number of Acai Berry Smoothies": "2.0",
            "Number of Banana Chocolate Smoothies": "3.0",
            "Minimum Total Amount of Water": "18.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 267,
        "question": "A handmade sports equipment manufacturing company makes basketballs and footballs. Basketballs require 5 units of materials and 1 hour to make whereas footballs require 3 units of materials and 2 hours to make. The manufacturing company has available 1500 units of materials and their workers working at max capacity can work for at most 750 hours. Since basketballs sell better, there must be at least three times as many basketballs as footballs but the manufacturing company would like at least 50 footballs. How many of each should the manufacturing company make to maximize the total number of sports equipment produced?",
        "results": {
            "Number of basketballs": "250.0",
            "Number of footballs": "83.0",
            "Maximized Total Number of Sports Equipment Produced": "333.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 268,
        "question": "A researcher must perform two types of experiments, in-vivo and ex-vivo. In-vivo experiments requires 30 minutes to prepare and 60 minutes to execute. Ex-vivo experiments require 45 minutes to prepare and 30 minutes to execute. In addition, in-vivo experiments gives the researcher 2 units of radiation while ex-vivo experiments give the researcher 3 unites of radiation. At most 400 minutes can be used for preparation and 500 minutes for execution of the experiment. How many of each experiment should be scheduled by the researcher to minimize the total radiation received by the researcher?",
        "results": {
            "Number of in-vivo experiments": "-0.0",
            "Number of ex-vivo experiments": "-0.0",
            "Minimized Total Radiation": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 269,
        "question": "A village delivers mail to nearby villages either by runners or canoers. Runners can carry three bags of mail each time and takes 4 hours. Canoers can carry ten bags of mail each time and takes 2 hours. At most 33% of deliveries can be by canoe. Additionally, the village can spare at most 200 total hours and at least 4 runners must be used. How many of each way to deliver must be used to maximize the total amount of mail that can be delivered?",
        "results": {
            "Number of deliveries by runners": "40.0",
            "Number of deliveries by canoers": "19.0",
            "Maximized total amount of mail delivered": "310.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 270,
        "question": "A woman on a diet needs to eat two types of meal preps, a smoothie and a protein bar. Each smoothie contains 2 units of protein and 300 calories. Each protein bar contains 7 units of protein and 250 calories. The woman must eat at least 2 times protein bars as smoothies. If the woman can consume at most 2000 calories, how many of each should she eat or drink to maximize her protein intake?",
        "results": {
            "Number of Smoothies": "-0.0",
            "Number of Protein Bars": "8.0",
            "Maximized Protein Intake": "56.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 271,
        "question": "A clinical firm has two factories, a northern factory and a western factory, where they make expensive anti-itch injections and topical cream. Every hour, the northern factory makes 800 g of anti-itch injections and 700 g of topical cream. Every hour, the western factory makes 650 g of anti-itch injections and 750 g of topical cream. The northern factory requires 40 units of plastic per hour while the western factory requires 35 units of plastic to manufacture the packaging. The clinical firm has available 60,000 units of plastic. Further, they must make at least 800,000 g of anti-itch injections and 700,000 g of topical cream. How many hours should each factory be run to minimize the total time needed?",
        "results": {
            "Hours for the Northern Factory": "1000.0",
            "Hours for the Western Factory": "0.0",
            "Minimized Total Time": "1000.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 272,
        "question": "A hospital prepares batches of medication patches and anti-biotic creams. Each medication patch requires 3 minutes to prepare and 5 units of materials. Each anti-biotic cream requires 5 minutes to prepare and 6 units of materials. Since anti-biotic creams are used more often, there must be at least twice as many anti-biotic creams as medication patches. Due to storage reasons, the hospital can make at most 100 batches of medication patches and anti-biotic creams in total. The hospital has available 400 minutes of staff to spare and 530 units of materials. If each batch of medication patches can treat 3 people and each batch of anti-biotic cream can treat 2 people, how many batches of each should be made to maximize the number of people that can be treated?",
        "results": {
            "Number of medication patches": "30.0",
            "Number of anti-biotic creams": "62.0",
            "Maximized Number of People Treated": "213.99999999999997"
        },
        "type": "linear-notable"
    },
    {
        "index": 273,
        "question": "A company in the desert can transport goods to rural cities either by camel caravans or desert trucks. A camel caravan can deliver 50 units of goods per trip and takes 12 hours. A desert truck can deliver 150 units of goods per trip and takes 5 hours. However, due to the cost of fuel, the company plans to have more camel caravans than desert trucks.  If the company needs to deliver 1500 units of goods, how many of each method of transportation should the company organize to minimize the total number of hours required?",
        "results": {
            "Number of camel caravans": "9.0",
            "Number of desert trucks": "7.0",
            "Minimized Total Number of Hours": "143.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 274,
        "question": "A biotechnology company has 35,000 units of antibiotics available which is important to the process of making a first-dose and second-dose of vaccines. The first-dose vaccine requires 30 units of antibiotics and 20 mg of gelatine whereas the second-dose vaccine requires 65 units of antibiotics and 60 mg of gelatine. Since the first-dose vaccine is required before the second-dose vaccine, there must be more first-dose than second-dose vaccines manufactured. However, at least 40 second-dose vaccines must be made. How many of each vaccine should be made to minimize the amount of gelatine used?",
        "results": {
            "Number of first-dose vaccines": "41.0",
            "Number of second-dose vaccines": "40.0",
            "Minimized amount of gelatine used": "3220.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 275,
        "question": "Both chemical A and chemical B need to be added to a mixer for making bread. One unit of chemical A takes 30 seconds to be effective while one unit of chemical B takes 45 seconds to be effective. Because chemical A can be dangerous, there has to be at most a third as much chemical A as chemical B in the mixer. If there has to be at least 300 units of chemical A in the mixer and at least 1500 units of total chemicals in the mixer, how many units of each should be added to minimize the total time it takes for the mixed bread to be ready?",
        "results": {
            "Number of units of chemical A": "375.0",
            "Number of units of chemical B": "1125.0",
            "Minimized Total Time": "61875.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 276,
        "question": "A senior home has snacks of spinach and soybeans to increase their intake of iron. A cup of spinach contains 100 units of fibre and 5 mg of iron. A cup of soybeans contains 80 units of fibre and 12 mg of iron. Due to other nutritional requirements, the nurses decided that the number of cups of spinach must exceed the number of cups of soybeans. Furthermore, a cup of spinach contains 30 calories while a cup of soybeans contains 100 calories. If they schedule that the elderly need in total at least 12000 units of fibre and 300 mg of iron, how many cups of each should the nurses schedule to minimize the seniors’ total caloric intake?",
        "results": {
            "Number of cups of Spinach": "120.0",
            "Number of cups of Soybeans": "-0.0",
            "Minimized Total Caloric Intake": "3600.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 277,
        "question": "A keyboard manufacturer makes mechanical and standard keyboards. Mechanical keyboards are becoming more popular and thus the manufacturer aims to have at least five times as many mechanical than standard keyboards. A mechanical keyboard costs five units of plastic and two units of solder whereas a standard keyboard costs two units of plastic and one unit of solder. There are still customers that prefer a less noisy alternative. Therefore, there must be at least 30 standard keyboards. If the company has available 1000 units of plastic and 380 units of solder, how many of each type should be manufactured to maximize the total number of keyboards?",
        "results": {
            "Number of mechanical keyboards": "173.0",
            "Number of standard keyboards": "34.0",
            "Maximized Total Number of Keyboards": "207.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 278,
        "question": "A tourism company can buy sedans or buses to add to their fleet of vehicles to increase their capacity for more tourists. A sedan can seat 50 tourists per day but results in 10 units of pollution. A bus can seat 250 tourists per day but results in 40 units of pollution. The city has limited this tourism company to producing at most 800 units of pollutants per day. To make a profit, this tourism company must take care of at least 4600 customers per day. Planning to make a profit, how many sedans and how many buses should this tourism company purchase to decrease the total number of vehicles needed?",
        "results": {
            "Number of Sedans": "0.0",
            "Number of Buses": "19.0",
            "Total Number of Vehicles Needed": "19.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 279,
        "question": "A dessert shop is popular for their only two desserts - matcha ice cream and orange sorbet. Two units of flavouring and four units of ice cream is required to make one order of matcha ice cream. Four units of flavouring and three units of water is required to make an order of orange sorbet. The dessert shop has recently been getting more orders online for orange sorbet and therefore, there should be more orange sorbet made than matcha ice cream. However, at least fifteen percent of desserts made must be matcha ice cream. The dessert shop has available 600 units of ice cream and 550 units of water. How many of each dessert should the shop make to minimize the total amount of flavouring needed?",
        "results": {
            "Number of Matcha Ice Cream orders": "0.0",
            "Number of Orange Sorbet orders": "0.0",
            "Minimum Total Amount of Flavoring Needed": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 280,
        "question": "A daycare center has children they must pick up and can use two types of vehicles: bus or a personal car. A bus can carry 9 children while a personal car can carry 4 children. The daycare has to pick up at least 100 children. Additionally, due to limitations of pollution, there must be more buses than personal cars. But some children require extra attention. Therefore, there must be at least 5 personal cars. How many of each form of transportation should the daycare center schedule for to minimize the total number of vehicles?",
        "results": {
            "Number of buses": "9.0",
            "Number of personal cars": "5.0",
            "Minimum Total Number of Vehicles": "14.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 281,
        "question": "Both coconut oil and lavender need to be added to a body wash. One unit of coconut oil takes 0.7 minutes to be effective while one unit of lavender takes 0.9 minutes to be effective. The body wash must contain at least 300 units of coconut oil and at most 550 units of both ingredients. Since too much coconut oil can make the body wash too oily, there can be at most thrice the amount of coconut oil as lavenders in the body wash. How many units of each should be added to the body wash to minimize the total amount of time it takes for the mixture to be effective? (Note: one must be added before the other)",
        "results": {
            "Number of units of Coconut Oil": "300.0",
            "Number of units of Lavender": "100.0",
            "Minimum Total Effective Time": "300.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 282,
        "question": "A chemical company uses two tests, a salinity test and a pH test. Each unit of the salinity test requires three probes. Whereas each unit of the pH test requires two probes. The chemical company must perform at least 250 pH tests. In total, at least 400 tests must be performed. Further, because of the importance of the salinity test, there must be at most 1.5 times more pH tests than salinity tests. How many times should each test be performed to minimize the total number of probes used?",
        "results": {
            "Number of Salinity Tests": "167.0",
            "Number of pH Tests": "250.0",
            "Minimum Total Number of Probes Used": "1001.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 283,
        "question": "A municipality hires full-time and part-time staff to deliver mail. Part-time staff works 15 hours per week and gets paid 450 dollars whereas a full-time staff works 40 hours every week and gets paid 1280 dollars  for that week.  Since it is the week leading up to a holiday, planning ahead, the municipality needs 1000 hours of mail staff labor. The municipality has a budget of 31500 dollars for mail delivery for this season. How many of each type of staff should the municipality hire to decrease the total number of staff?",
        "results": {
            "Number of Full-Time Staff": "16.0",
            "Number of Part-Time Staff": "24.0",
            "Total Number of Staff": "40.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 284,
        "question": "A landscaper has 2500 square feet of grass land in a customer’s backyard where they need to cut grass using either a heavy-duty yard machine or a gas lawn mower. For each square foot of land, the heavy-duty yard machine requires 2 seconds while the gas lawn mower takes 5 seconds. Per square foot, the heavy-duty yard machine produces 12 units of pollution and requires 3 units of fuel. Conversely, the gas lawn mower generates 10 units of pollution for each square foot and requires 2 units of fuel. There are 450 units of fuel available and the landscaper can produce no more than 2000 units of pollution. For how many square feet should each machine be used to minimize the time required to cut this customer’s backyard?",
        "results": {
            "Square feet cut by heavy-duty yard machine": "-0.0",
            "Square feet cut by gas lawn mower": "-0.0",
            "Minimum Time Required (in seconds)": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 285,
        "question": "A park is designing their trails and can either create a wide trail or a narrow trail. A wide trail can take 50 visitors every day while the narrow trail expects 20 visitors every day. The wide trail will introduce 6 units of garbage and the narrow trail will introduce 3 units of garbage. There can be at most 3 wide trails and the park hopes to have at most 225 visitors every day. How many of each type of trail should the park construct to minimize the total amount of garbage produced.",
        "results": {
            "Number of wide trails": "-0.0",
            "Number of narrow trails": "-0.0",
            "Minimized Total Garbage": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 286,
        "question": "A brewery can ferment their product into either wine or kombucha. Each unit of wine requires 3 units of fruit and 8 units of water. Each unit of kombucha requires 5 units of fruit and 7 units of tea. The company has available 7000 units of water and 9000 units of tea. Wine sells for more, therefore the number of wine must be larger than the number of kombucha. Additionally, at least 20% of their products made must be kombucha. How many of each should the brewery make to minimize the total units of fruit required?",
        "results": {
            "Number of units of Wine": "0.0",
            "Number of units of Kombucha": "0.0",
            "Minimum Total Units of Fruit Required": "0.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 287,
        "question": "A hospital can transport their patients either using a type II ambulance or hospital van. The hospital needs to transport 320 patients every day. A type II ambulance is mounted on a truck-style chassis and can move 20 patients every shift and costs the hospital (including gas and salary) $820. A hospital van can move 15 patients and costs the hospital $550 every shift. The hospital can have at most 60% of shifts be hospital vans due to union limitations of the type II ambulance drivers. How many of shift using each type of vehicle should be scheduled to minimize the total cost to the hospital?",
        "results": {
            "Number of shifts for Type II ambulance": "10.0",
            "Number of shifts for Hospital Van": "8.0",
            "Minimized Total Cost": "12600.0"
        },
        "type": "linear-notable"
    },
    {
        "index": 288,
        "question": "An incandescent bulb manufacturing company uses either an argon gas approach or halogen gas approach to fill their light bulbs. The argon gas approach uses 10 units of gas and 12 units of glass to make 2 light bulbs. The halogen gas approach uses 12 units of gas and 8 units of glass to make 3 light bulbs. Additionally, the argon gas approach generates 3 units of heat while the halogen gas approach creates 4 units of heat. The manufacturing company has available 150 units of gas and 120 units of glass. If at most 28 units of heat can be generated during the manufacturing process, how many of each method should be used to maximize the number of light bulbs produced?",
        "results": {
            "Number of Argon gas approach used": "0.0",
            "Number of Halogen gas approach used": "7.0",
            "Maximized Number of Light Bulbs Produced": "21.0"
        },
        "type": "linear-notable"
    }
]